/**
 * Created by shuiliu on 14-5-12.
 */
Resource.KoreanTxt = Resource.KoreanTxt || {};
Resource.KoreanTxt["first_tip"] = "게임이용약관 및 개인정보 수집, 이용에 동의 합니다";
Resource.KoreanTxt["confirm_tip"] ="게임이용약관과 개인정보 수집, \n이용에 동의해 주세요.";//请同意使用个人信息
Resource.KoreanTxt["first_tip_full"] ="개인정보취급방침\n\n총칙\n(주)추콩테크놀로지코리아(이하 '회사')는 원활하고 편리한 서비스 제공을 위해 최선의 노력을 다하고 있습니다. \n또한 회사는 ‘정보통신망 이용촉진 및 정보보호 등에 관한 법률’(이하 '정보통신망법'), \n개인정보보호법, 관계 법령의 개인정보보호규정 등을 준수함으로써 이용자 및 회원의 개인정보 보호를 위한 조치를 취하고 있습니다.\n‘개인정보’라 함은 생존하는 개인에 관한 정보로서 성명, 주민등록번호 등에 의하여 당해 개인을 알아볼 수 있는 부호, 문자, \n음성, 음향 및 영상 등의 정보(당해 정보만으로는 특정 개인을 알아볼 수 없는 \n경우에도 다른 정보와 용이하게 결합하여 알아볼 수 있는 것을 포함)를 말합니다.\n회사는 이용자의 개인정보를 ‘1. 수집하는 개인정보의 항목 및 수집방법’, \n‘3. 개인정보의 수집 및 이용 목적’에서 고지한 범위 내에서 이용하며, 동 범위를 초과하거나 변경하는 경우에는 사전에 이용자의 동의를 받습니다.\n 개인정보의 보유 및 이용기간의 변경, 제3자 제공 및 취급 위탁 시 내용의 변경 또한 동일하며, 주요한 변경 내용에 대하여 이용자에게 모두 알리고 인터넷 사이트, \n서면, 전화, 전자우편 등의 방법을 통하여 동의를 받습니다. 단, 법률에서 예외로 처리하는 ‘이용자와의 계약에 의한 서비스 제공을 위해 필요한 경우로서 동의 취득이 곤란한 경우’,\n ‘요금 정산을 위해 필요한 경우’, ‘다른 법률에 특별한 규정이 있는 경우’ 이상 3가지에 해당할 때는 별도의 동의 없이 이용자에게 알리는 것으로 갈음할 수 있습니다.\n본 개인정보취급방침은 관계 법령 및 지침의 변경이나 회사의 내부 방침 변경 등으로 인하여 변경될 수 있으며, 변경 시 회사는 변경 이유 및 내용에 대하여 즉시 홈페이지를 통해 공지합니다.\n\n1.	수집하는 개인정보의 항목 및 수집 방법\n\n회사는 이용자의 회원 가입 시, 아래와 같은 이용자의 개인정보를 수집하고 있으며 회원제 서비스를 이용하기 위해서는 필수 수집 항목을 반드시 입력하여야 합니다.\n①	수집 방법 : 홈페이지, 어플리케이션, 서면양식, 전화, 팩스 등\n②	필수 수집 항목 : E메일 주소, 필요 시 개인식별정보\n③	게임 서비스 이용 시 수집 항목 : 접속 정보, IP주소, 서비스 이용 기록 등\n④	카카오 게임 연동 플랫폼일 경우: 카카오 게임 ID, 카카오톡 닉네임, 카카오톡 친구목록, 카카오톡 프로필 사진 등\n\n2.	개인정보의 수집 및 이용 목적\n\n회사가 수집한 개인정보의 수집 및 이용 목적은 다음과 같습니다.\n\n1)	회원의 관리\n①	서비스 이용에 따른 본인 식별 : E메일 주소";

Resource.KoreanTxt["first_tip_full_1"] ="\n②	불만처리 등 민원처리 : 성명, E메일주소, 전화번호\n③	고지사항의 전달 등 원활한 의사소통 경로의 확보 : E메일, 전화번호\n④	분쟁조정/해결을 위한 기록보존 : E메일 주소, 접속 정보, 서비스 이용 기록, 전화번호\n⑤	불량회원의 부정이용 방지와 비인가 사용방지 : 서비스 이용 기록\n⑥	중복 가입의 확인 : E메일\n\n2)	서비스 제공에 관한 계약의 이행 및 서비스 제공에 따른 요금의 정산\n①	콘텐츠 제공 : E메일 주소, 전화번호, 서비스 이용 기록, 접속 정보\n②	물품 배송 또는 청구서 등 발송 : 성명, E메일, 전화번호, 주소\n\n3)	신규서비스 및 마케팅에의 활용\n①	새로운 서비스 및 신상품이나 이벤트 정보의 안내 : 전화번호, E메일\n②	경품 등의 배송에 대한 정확한 배송지의 확보 : 성명, E메일, 전화번호, 주소\n\n3.	개인정보의 보유 및 이용 기간 \n\n1)	회사는 원칙적으로 개인정보 수집 및 이용 목적이 달성된 후에는 해당 정보를 지체 없이 파기합니다. 단, 다음의 정보에 대해서는 ‘보존 근거’에서 명시한 근거에 따라 ‘보존 기간’동안 보존합니다.\n①	보존 항목 : E메일 주소, 접속 정보, 서비스 이용 기록\n②	보존 근거 : 회원 탈퇴 시 소비자의 불만 및 분쟁 해결 등을 위한 목적\n③	보존 기간 : 30일\n\n2)	상법, 전자상거래 등에서의 소비자보호에 관한 법률 등 관계 법령의 규정에 의해 보존할 필요성이 있는 경우 회사는 관계법령에서 정한 일정한 기간 이상 이용자의 개인정보를 보관할 수 있습니다. 이 경우 회사는 보관하는 정보를 그 보관의 목적으로만 이용하며, ‘보존 근거’에서 명시한 근거에 따라 ‘보존 기간’동안 보존합니다.\n①	계약 또는 청약 철회 등에 관한 기록\n-	보존 근거 : 전자상거래 등에서의 소비자보호에 관한 법률\n-	보존 기간 : 5년\n②	대금결제 및 재화 등의 공급에 관한 기록\n-	보존 근거 : 전자상거래 등에서의 소비자보호에 관한 법률\n-	보존 기간 : 5년\n③	소비자의 불만 또는 분쟁처리에 관한 기록\n-	보존 근거 : 전자상거래 등에서의 소비자보호에 관한 법률\n-	보존 기간 : 3년\n④	본인 확인에 관한 기록\n-	보존 근거 : 정보통신망 이용촉진 및 정보보호 등에 관한 법률\n-	보존 기간 : 6개월\n";

Resource.KoreanTxt["first_tip_full_2"] ="\n4.	개인정보의 파기 절차 및 방법\n\n회사는 원칙적으로 개인정보 수집 및 이용 목적이 달성된 후에는 해당 정보를 지체 없이 파기합니다. 파기 절차 및 방법은 다음과 같습니다.\n\n1)	파기 절차\n회사는 이용자가 일정기간 동안 서비스를 이용하지 않거나 회원 탈퇴를 신청하는 경우 소비자의 불만 및 분쟁 해결 등을 위한 목적으로 30일간 개인정보를 보관 한 후, 재생이 불가능한 방법으로 파기합니다.\n\n2)	파기 방법\n①	전자적 파일 형태로 저장된 개인정보는 기록을 재생할 수 없는 기술적 방법을 사용하여 삭제합니다.\n②	종이에 출력된 개인정보는 분쇄기로 분쇄하여 파기합니다.\n\n5.	개인정보의 제공\n\n회사는 이용자의 개인정보를 원칙적으로 외부에 제공하지 않습니다. 다만, 아래의 경우에는 예외로 합니다.\n①	이용자들이 사전에 동의한 경우\n②	법령의 규정에 의거하거나, 수사 목적으로 법령에 정해진 절차와 방법에 따라 수사기관의 요구가 있는 경우 \n\n\n6.	개인정보의 위탁\n\n회사는 고객님의 동의없이 고객님의 정보를 외부 업체에 위탁하지 않습니다. 향후 그러한 필요가 생길 경우, 위탁 대상자와 위탁 업무 내용에 대해 고객님에게 통지하고 필요한 경우 사전 동의를 받도록 하겠습니다.\n\n7.	이용자 및 법정대리인의 권리와 그 행사 방법\n\n1)	만14세 미만 아동의 개인정보보호\n①	회사는 만14세 미만 아동(이하 '아동')의 개인정보에 대한 수집/이용/제공 등의 동의가 필요한 경우, 아동의 동의와 별도로 법정대리인의 동의를 받습니다.\n②	1항의 동의를 받기 위하여 회사는 법정대리인의 성명, 연락처 등 필요한 최소한의 정보를 요구할 수 있으며, 이와 같이 수집된 법정대리인의 개인정보는 해당 법정대리인의 동의 여부를 확인하는 목적 외의 용도로 이용되거나 제3자에게 제공하지 아니합니다.\n③	법정대리인의 동의서는 아동과 회사의 계약, 청약 철회, 대금 결제, 재화 공급 등이 발생할 시 소비자의 불만 및 분쟁 해결 등을 위한 용도로 이용됩니다.\n④	탈퇴한 아동의 법정대리인 동의서, 동의 철회 또는 유효 기간이 만료된 법정대리인 동의서는 이용 목적이 만료된 30일 이후에 재생이 불가능한 방법으로 파기됩니다. 다만, 상법 또는 전자상거래 등에서의 소비자보호에 관한 법률 등 관계법령의 규정에 의해 보존할 필요성이 있는 경우 회사는 관계법령에서 정한 기간 동안 법정대리인의 개인정보를 보관합니다.\n⑤	아동의 법정대리인은 당해 아동 개인정보의 열람, 정정 요구, 또는 개인정보의 수집 이용 및 제공에 ";
Resource.KoreanTxt["first_tip_full_3"] ="대한 동의의 철회를 요청할 수 있으며, 이러한 요청이 있을 경우 회사는 필요한 조치를 지체 없이 취하도록 합니다\n\n2)	이용자 자신의 개인정보 관리에 관한 사항\n①	이용자는 개인정보관리책임자에게 서면, 전화, E메일 등을 통해 개인정보 수집에 대한 동의를 철회할 수 있으며, 그 경우 회사는 본인 여부를 확인한 후 법령에 다르게 규정하고 있는 경우를 제외하고는 당해 개인정보의 파기 등 필요한 조치를 취합니다. 단, 회원 탈퇴로 인하여 개인정보가 파기되는 경우에는 해당 이용자가 회사의 서비스를 이용하면서 생성, 축적한 관련 정보가 함께 파기될 수 있습니다.\n②	회사는 이용자의 대리인이 방문하여 열람 또는 정정 요구를 하는 경우에는 이용자의 진정한 대리인인지 여부를 확인하며 이 경우 회사는 대리 관계를 나타내는 증표를 제시하도록 요구할 수 있습니다. \n③	회사는 이용자의 당해 개인정보의 전부 또는 일부에 대하여 열람 또는 정정요구를 거절할 정당한 이유가 있는 경우에 회원에게 이를 지체 없이 통지하고 그 이유를 설명합니다. \n④	E메일 주소 등 회원가입 시 이용자가 제공한 필수입력 항목들의 변경은 회사가 제공하는 서비스에 오류 등을 발생시킬 수 있는 사항이기 때문에, 회사는 원활하고 안정적인 서비스 제공을 위하여 회원의 필수입력 항목 변경에 대해서는 해당 회원에게 별도로 절차를 요청할 수 있습니다. \n\n8.	개인정보의 기술적/관리적 보호 대책\n\n회사는 이용자의 개인정보를 취급함에 있어 개인정보가 분실, 도난, 누출, 변조 또는 훼손되지 않도록 안전성 확보를 위해 기술적, 관리적 대책을 마련하고 있습니다.\n\n1)	기술적 대책\n①	회사는 암호화 통신을 통하여 네트워크 상에서 개인정보를 안전하게 전송할 수 있도록 하고 있습니다.\n②	회사는 해킹이나 컴퓨터바이러스 등에 의해 회원의 개인정보가 유출되거나 훼손되는 것을 막기 위해 최선을 다하고 있습니다.\n③	회사는 만약의 사태를 대비하여 개인정보를 주기적으로 백업하고 있으며, 백신 프로그램을 이용하여 컴퓨터 바이러스에 의한 피해를 방지하기 위한 조치를 취하고 있습니다.\n④	회사는 시스템에 대한 접근 통제, 권한 관리, 취약점 점검 등의 조치를 통해 보안성이 강화될 수 있도록 지속적으로 노력하고 있습니다.\n\n2)	관리적 대책\n①	회사는 이용자의 개인정보에 대한 접근 권한을 최소한의 인원으로 제한하고 있으며, 그 최소한의 인원에 해당하는 자는 다음과 같습니다.\n-	이용자를 직접 상대로 하여 마케팅, 고객 지원, 게임 운영, 배송 업무를 수행하는 자(위탁, 협력 업체의 직원 포함)\n-	개인정보관리책임자 등 개인정보 관리 업무를 수행하는 자\n-	기타 업무상 개인정보의 취급이 불가피한 자\n②	회사는 개인정보취급자를 대상으로 개인정보 보호 의무 등에 관해 정기적인 교육을 실시하고 있습니다.\n③	회사는 개인정보 보호 업무를 담당하는 부서에서 개인정보 취급방침 및 내부 규정 준수 여부를 확인하여 문제가 발견될 경우, 즉시 바로 잡을 수 있도록 노력하고 있습니다.\n④	이용자 본인의 부주의나 인터넷상의 문제로 개인정보가 유출되어 발생한 문제에 대해서는 회사가 일체 책임을 지지 않습니다.\n";
//Resource.KoreanTxt["first_tip_full_4"] ="";
Resource.KoreanTxt["first_tip_full_4"] ="\n9.	개인정보에 관한 민원서비스\n\n1)	회사는 이용자의 개인정보를 보호하고 개인정보와 관련한 불만을 처리하기 위하여 아래와 같이 개인정보 관리 책임자를 지정하고 있습니다. \n①	개인정보관리책임자\n-	성명/직책 : 박준범/경영기획팀장\n-	전화번호 : 02-3431-9909\n-	E메일 : alex@kr.chukong-inc.com\n\n2)	회원 가입 시 동의하신 바 있는 개인정보 제3자 제공 및 개인정보 취급 위탁에 대한 동의 철회 등 회사의 서비스를 이용하며 발생하는 모든 개인정보 보호 관련 민원을 개인정보 관리 책임자에게 신고할 수 있습니다. 회사는 이용자의 신고 사항에 대해 신속하게 대응할 것입니다.\n\n3)	기타 개인정보침해에 대한 신고나 상담이 필요하신 경우에는 아래 기관에 문의하시기 바랍니다.\n①	전자거래분쟁조정위원회 http://www.ecmc.or.kr:8080/app/main (1661-5714)\n②	정보보호마크인증위원회 www.eprivacy.or.kr (02-580-0533)\n③	개인정보 침해신고 센터 http://privacy.kisa.or.kr/kor/main.jsp (02-405-5118)\n④	경찰청 사이버테러대응센터 www.ctrc.go.kr (02-392-0330) \n⑤	불법청소년유해정보신고 http://www.singo.or.kr (국번없이 1377)\n\n10.	링크 사이트\n\n회사는 이용자에게 다른 회사의 웹사이트 또는 자료에 대한 링크를 제공할 수 있습니다. 이 경우 회사는 외부 사이트 및 자료에 대한 아무런 통제권이 없으므로 그로부터 제공 받는 서비스나 자료의 유용성에 대해 책임질 수 없으며 보증할 수 없습니다. 회사가 포함하고 있는 링크를 통해 타 사이트의 페이지로 옮겨갈 경우 해당 사이트의 개인정보 취급 방침은 회사와 무관하므로 새로 방문한 사이트의 정책을 확인하시기 바랍니다.\n\n11.	기타\n\n본 개인정보취급방침은 법령 정책 또는 보안기술의 변경에 따라 내용의 추가 삭제 및 수정이 있을 시에는 변경되는 개인정보 취급 방침을 시행하기 최소 7일 전에 홈페이지 혹은 기타 수단을 통해 변경 이유 및 내용 등을 공지하도록 하겠습니다.\n\n제정일 : 2013년 10월 01일\n시행일 : 2013년 10월 01일\n\n\n\n\n\n";

Resource.KoreanTxt["second_tip_full_1"] = "㈜추콩테크놀로지코리아 사용자 이용약관\n\n제 1 조 (목적)\n\n본 약관은 주식회사 추콩테크놀로지코리아(이하 “회사”)가 무선통신망 등을 이용하여 제공하는 모바일게임 어플리케이션 및 이에 부수된 제반 서비스\n(이하 “게임서비스”)와 관련하여 회사와 회원간의 권리, \n의무 및 기타 필요한 사항을 규정함을 그 목적으로 합니다.\n\n제 2 조 (정의)\n\n본 약관에서 사용하는 용어의 정의는 다음과 같습니다.\n\n① “회원”이라 함은 회사의 게임서비스에 접속하여 본 약관에 따라 회사와 이용계약을 체결하고 회사가 제공하는 게임서비스를 이용하는 고객을 말합니다. \n② “계정”이라 함은 회원의 식별과 서비스 이용을 위하여 회원이 정하고 회사가 승인하는 문자와 숫자의 조합을 의미합니다. \n③ “비밀번호”라 함은 회원이 부여 받은 계정과 일치되는 회원임을 확인하고, 회원 개인의 정보보호를 위해 자신이 정한 문자 또는 숫자의 조합을 의미합니다. \n④ “유료서비스”라 함은 회사가 유료로 제공하는 각종 디지털콘텐츠(캐쉬, 아이템, 아바타, 기타 유료 콘텐츠를 포함) 및 제반 서비스를 의미합니다. \n⑤ “포인트”라 함은 회사가 임의로 책정 또는 지급, 조정, 회수 할 수 있는 환가성 및 재산적 가치가 없는 서비스 상의 가상 데이터를 의미합니다. \n⑥ “게시물”이라 함은 회원이 게임서비스를 이용함에 있어 게임서비스 상에 게시한 부호ㆍ문자ㆍ음성ㆍ음향ㆍ화상ㆍ동영상 등의 정보 형태의 글, \n사진, 동영상 및 각종 파일과 링크 등을 의미합니다. \n\n제 3 조 (약관의 적용 및 변경)\n\n① 회사는 본 약관의 내용을 회원이 쉽게 알 수 있도록 게임서비스 초기화면이나 회사의 홈페이지(http://kr.chukong-inc.com/)에 게시하는 방식으로 회원에게 공지합니다.\n② 회사는 필요한 경우 「전자상거래 등에서의 소비자보호에 관한 법률」, 「약관의 규제에 관한 법률」, 「게임산업진흥에 관한 법률」, \n「정보통신망이용촉진 및 정보보호 등에 관한 법률」, 「콘텐츠산업진흥법」 등 관계 법령에 위배하지 않는 범위 내에서 본 약관을 개정할 수 있습니다.\n③ 회사가 약관을 변경할 경우, 변경된 약관의 내용과 적용일자를 명시하여 그 적용일로부터 7일 전까지 제1항의 방식에 따라 공지합니다. \n다만, 회원에게 불리한 약관의 개정인 경우에는 적용일로부터 30일 전까지 동일한 방식으로 공지합니다. \n④ 본 약관에 동의하는 것은 정기적으로 회사의 홈페이지를 방문하여 약관의 변경 사항을 확인하는 것에 동의함을 의미합니다.\n 변경된 약관에 대한 정보를 알지 못하여 발생하는 회원의 피해에 대해서 회사는 책임지지 않습니다.\n";
Resource.KoreanTxt["second_tip_full_2"] = "⑤ 회원이 개정된 약관의 적용에 대하여 동의하지 않는 경우, 변경된 약관의 적용을 거부할 수 있습니다. \n본 약관의 변경에 대해 이의가 있는 회원은 서비스 이용을 중단하고 이용계약을 해지(회원탈퇴)할 수 있습니다. \n⑥ 변경된 약관의 적용일 이후에도 게임서비스를 계속해서 이용하는 경우, 회사는 변경된 약관에 동의한 것으로 간주합니다. \n\n제 4 조 (약관 외 준칙)\n\n① 회사는 운영정책 등을 통하여 본 약관의 구체적인 내용을 정할 수 있으며, 이 경우 운영정책 등은 본 약관에 대한 보충적 효력을 갖습니다.\n② 본 약관에서 정하지 아니한 사항과 해석에 관하여는 관계 법령 또는 상관례에 따릅니다. \n\n제 5 조 (이용계약의 승낙과 제한)\n\n① 서비스 이용계약은 회원이 되고자 하는 자가 본 약관을 읽고 그 내용에 동의한 후 회사가 지정하는 양식과 절차에 따라 신청을 하면, \n회사가 그러한 신청에 대하여 이용을 승낙함으로써 성립합니다. \n② 회원이 되고자 하는 자는 반드시 본인의 진정한 정보로써 이용신청을 하여야 하며, 이를 위반한 경우 회사는 이용신청을 거절하거나 게임서비스 이용에 제한을 둘 수 있습니다.\n③ 회사는 업무 상 또는 기술 상의 문제가 없는 경우, 게임서비스 이용신청을 승낙함을 원칙으로 합니다. \n단, 회사는 회사의 설비에 여유가 없거나 기술 상 장애가 발생한 경우, 해당 원인이 해소될 때까지 승낙을 유보할 수 있습니다. \n\n제 6 조 (계정 및 비밀번호) \n\n① 회원은 자신의 계정과 비밀번호가 노출되지 않도록 최선의 주의를 다하여야 합니다. 회원의 과실로 계정과 비밀번호가 노출되어 발생되는 피해 및 결과에 대한 책임은 회원 자신에게 있습니다. \n② 만약 회원 본인의 계정 및 비밀번호를 도난 당하거나 제3자가 사용하고 있음을 알게 된 때에는 즉시 회사에 통보하고 회사의 안내가 있는 경우 그에 따라야 합니다. \n③ 회원은 계정정보보호 등을 위하여 정기적으로 비밀번호를 변경하여야 합니다.\n\n제 7 조 (정보의 제공 및 변경) \n\n① 회원은 회원가입 시 진실된 정보를 제공하여야 하며, 허위정보 제공 등으로 인하여 발생한 불이익에 대해서는 보호 받을 수 없습니다.\n② 회원은 자신이 제공한 개인정보를 수정할 수 있습니다. 다만, 일부 정보의 경우 수정이 불가능 할 수 있습니다. \n③ 회원은 회사에 제공한 정보가 변경되었을 경우, 지체 없이 게임서비스 내 관리페이지나 회사 홈페이지 등을 통하여 변경된 정보로 수정하여야 합니다.\n④ 변경된 사항을 회사에 알리지 않아 발생한 불이익에 대하여 회사는 책임을 지지 않습니다.\n\n제 8 조 (개인정보의 보호 및 관리)\n\n① 회사는 관계 법령이 정하는 바에 따라 계정정보를 포함한 회원의 개인정보를 보호하기 위해 노력합니다. \n";
Resource.KoreanTxt["second_tip_full_3"] = "회원 개인정보의 보호 및 사용에 대해서는 관계 법령 및 회사가 별도로 고지하는 개인정보취급방침이 적용됩니다.\n② 회사는 게임서비스 또는 홈페이지 등에서 단순히 링크된 제3자 제공의 서비스에 대하여는 회사의 개인정보취급방침이 적용되지 않습니다.\n③ 회사는 회원의 귀책사유로 인하여 노출된 회원의 계정정보를 포함한 모든 정보에 대해서 일체의 책임을 지지 않습니다.\n\n제 9 조 (회사의 의무)\n\n① 회사는 관계 법령 및 본 약관에서 금지하거나 미풍양속에 반하는 행위를 하지 않으며, 계속적이고 안정적인 서비스를 제공하기 위하여 노력합니다. \n② 만약 설비에 장애가 생기거나 데이터 등이 멸실된 때에는 부득이한 사유가 없는 한 지체 없이 이를 수리 또는 복구하도록 최선의 노력을 다합니다.\n③ 회사는 회원의 개인정보보호를 위해 보안시스템을 구축하며 개인정보 취급방침을 공개하고 준수합니다. \n\n제 10 조 (회원의 의무)\n\n① 회원은 다음 행위를 하여서는 안 됩니다. \n1. 회원가입 신청 또는 변경 시 허위 내용을 등록한 경우\n2. 회사의 운영진, 직원 또는 관계자를 사칭하는 경우\n3. 다른 회원의 정보가 도용되거나 비정상적으로 사용된 것으로 회사가 판단 또는 의심하는 경우\n4. 타인의 게임서비스 이용을 방해하는 경우\n5. 회사의 정상적인 게임서비스의 제공을 고의로 방해한 경우\n6. 게임의 기술적 보호조치를 무력화하거나 정상적인 운영을 방해할 목적으로 회사가 제공 또는 승인하지 아니한 컴퓨터 프로그램이나 기기 또는 장치를 이용하는 경우\n7. 게임 내 버그를 악용하거나 비정상적인 방법으로 캐쉬, 게임머니, 아이템 등을 취득하는 경우\n8. 회사의 사전승낙 없이 게임서비스를 이용한 영업활동을 하는 경우\n9. 회원 계정을 타인과 거래하거나 계정 내 캐쉬, 게임머니, 아이템 등을 타인과 매매하는 경우\n10. 회사 또는 제3자의 저작권 등 기타 지식재산권을 침해하는 내용을 전송, 게시, 전자우편 또는 기타의 방법으로 타인에게 유포하는 경우\n11. 게임서비스를 통하여 얻은 정보를 회사의 사전승낙 없이 게임서비스 이용 외의 목적으로 복제하거나 이를 출판 및 방송 등에 사용하거나 제3자에게 제공하는 경우\n 12. 다른 회원을 희롱, 위협하거나 특정 이용자에게 지속적으로 고통, 불편을 주는 행위를 하는 경우\n13. 모욕적이거나 개인신상에 대한 내용이어서 타인의 명예나 프라이버시를 침해할 수 있는 내용을 전송, 게시, 전자우편 또는 기타의 방법으로 타인에게 유포하는 경우\n14. 공공질서 및 미풍양속에 위반되는 음란한 내용의 정보, 문장, 도형, 음향, 동영상을 전송, 게시, 전자우편 또는 기타의 방법으로 타인에게 유포하는 경우\n15. 범죄와 관련이 있다고 객관적으로 판단되는 경우\n16. 기타 관계 법령에 위반하는 행위를 하는 경우\n② 회원은 본 약관, 운영정책, 공지사항 등을 확인하고 준수하여야 합니다. \n\n";
Resource.KoreanTxt["second_tip_full_4"] ="제 11 조 (서비스의 제공 및 중단)\n\n① 회사는 특별한 사정이 없는 한 연중무휴 1일 24시간 서비스 제공을 원칙으로 합니다. \n② 제1항에도 불구하고 다음 각 호에 해당하는 경우 회사는 게임서비스를 중단할 수 있습니다. \n1. 컴퓨터 등 정보통신설비의 보수점검, 교체, 정기점검 또는 게임 내용이나 게임서비스의 수정을 위하여 필요한 경우\n2. 해킹 등의 전자적 침해사고, 통신사고, 회원들의 비정상적인 게임 이용행태, 미처 예상하지 못한 게임서비스의 불안정성에 대응하기 위하여 필요한 경우\n3. 관련 법령에서 특정 시간 또는 방법으로 게임서비스 제공을 금지하는 경우\n4. 천재지변, 비상사태, 정전, 서비스 설비의 장애 또는 서비스 이용의 폭주 등으로 정상적인 게임서비스 제공이 불가능할 경우\n5. 회사의 분할, 합병, 영업양도, 영업의 폐지, 당해 게임서비스의 수익 악화 등 회사의 경영상 중대한 필요에 의한 경우\n③ 회사가 기술 상 또는 경영 상의 사유로 게임서비스를 영구적으로 종료하는 경우, 게임서비스 종료에 관한 사실을 30일 전부터 홈페이지에 공지한 후 종료합니다. \n④ 게임서비스가 종료되는 경우 회원은 무료 게임서비스 및 사용기간이 남아 있지 않은 유료서비스 등에 대하여 손해배상을 청구할 수 없습니다.\n 사용기간이 영구이거나 표시되지 않은 유료서비스의 경우 서비스 종료일까지를 사용기간으로 봅니다. \n⑤ 게임서비스의 일시적 중단 또는 종료 시 회사는 홈페이지를 통하여 사전에 통지합니다. 단, 특별한 사정이 있는 경우 사후에 통지할 수 있습니다.\n\n제 12 조 (유료서비스) \n\n① 회사가 제공하는 게임서비스의 일부 또는 전부는 회사의 정책에 따라 유료로 제공될 수 있습니다. \n② 유료서비스를 이용하고자 하는 경우, 회원은 유료서비스 이용에 대한 대가를 회사가 정한 방법에 따라 성실히 납부하여야 합니다.\n\n제 13 조 (포인트 서비스) \n\n① 회사는 이벤트 등의 사유로 회원에게 포인트를 제공할 수 있습니다.\n② 무료로 지급되는 포인트의 유효기간은 지급 시 명시한 기간에 따르며, 명시되지 않은 포인트의 경우 유효기간은 1년 입니다. 유효기간 내에 사용되지 않은 포인트는 환불되지 않습니다. \n③ 회사는 경영 상, 기술 상 이유로 포인트 서비스를 종료할 수 있으며, 종료 30일 전에 홈페이지에 공지한 후 서비스를 종료합니다. 서비스 종료일까지 사용되지 않은 포인트는 자동 소멸됩니다.\n④ 회원이 탈퇴를 하거나 회사가 계정을 삭제하는 경우, 사용되지 않은 포인트도 함께 삭제됩니다.\n\n제14조 (게시물의 관리)\n\n① 회사는 회원이 게시하거나 등록하는 게임서비스 내의 게시물 또는 게시 내용에 대해 제 10조에서 규정하는 금지행위에 해당된다고 판단되는 경우,\n 사전통지 없이 이를 삭제하거나 이동 또는 등록을 거부할 수 있습니다.\n";
//Resource.KoreanTxt["second_tip_full_5"] ="";
Resource.KoreanTxt["second_tip_full_5"] ="② 회사가 운영하는 게시판 등에 게시된 정보로 인하여 법률 상 이익이 침해된 회원은 회사에게 당해 정보의 삭제 또는 반박내용의 게재를 요청할 수 있습니다. \n이 경우 회사는 신속하게 필요한 조치를 취하고, 이를 신청인에게 통지합니다. \n\n제15조 (게시물에 대한 저작권)\n\n① 회원 게임서비스 내에 게시한 게시물은 검색결과, 정보성 이메일, 서비스 및 회사가 운영하는 다른 서비스, 프로모션 등에 노출될 수 있으며, 해당 노출을 위해 필요한 범위 내에서는 일부 수정, \n복제, 편집되어 게시될 수 있습니다. 이 경우 회사는 저작권법의 내용을 준수하며, 회원은 언제든지 고객센터 또는 게임서비스 내 관리기능을 통해 해당 게시물에 대해 삭제, \n검색 결과 제외, 비공개 등의 조치를 취할 수 있습니다.\n② 회원은 게임서비스를 이용함으로써 얻은 회사의 게시물을 포함한 저작물을 회사의 사전 서면 승낙 없이 임의가공, \n복제, 공중송신(전송, 방송 포함), 출판, 배포, 발행 기타 방법에 의하여 이용하거나 공중에 배포, 유포하여서는 안됩니다.\n③ 회원의 게시물이 제3자의 저작권 등 지적재산권을 침해함으로써 발생하는 민•형사상의 책임은 전적으로 회원 자신이 부담하여야 합니다.\n④ 회사는 제1항 이외의 방법으로 회원의 게시물을 이용하는 경우 저작권법에 따라 저작물의 이용허락을 받아야 합니다.\n⑤ 제1항은 회사가 서비스를 운영하는 동안 유효하며 이용자의 탈퇴 후에도 지속적으로 적용됩니다.\n\n제 16 조 (정보의 제공 및 광고의 게재)\n\n① 회사는 회원이 필요하다고 인정되는 다양한 정보를 공지사항 또는 배너를 통하여 게시하거나 수신에 동의한 회원에 한하여 전자우편이나 문자메시지 발송 등의 방법으로 제공할 수 있습니다. \n② 회사는 게임서비스 내에 회사 또는 제3자의 상품, 서비스, 용역 등에 대한 광고를 노출할 수 있으며, 회원은 이에 동의합니다. \n③ 제2항의 광고에 회원이 참여하거나 거래를 함으로써 발생하는 손실과 손해에 대해서, 회사는 어떠한 책임도 부담하지 않습니다.\n\n제 17 조 (정보의 수집)\n\n회사는 채팅내용 등 게임서비스 내에서 이루어지는 통신내용을 저장 및 보관할 수 있습니다. 본 정보는 회사만이 보유하고 적법한 제3자 외에는 제공받거나 열람할 수 없습니다. \n회사는 약관•법령 위반행위 조사, 회원간의 분쟁조정, 민원처리 또는 기타 게임서비스 내 질서유지를 위하여 필요한 경우에 한해 본 정보를 활용하며, 자료 활용 시에는 활용내용에 대해 회원에게 통지합니다. \n\n제 18 조 (청약의 철회) \n\n① 유료서비스는 청약철회가 가능한 것과 제한되는 것으로 구분되며, 이러한 내용은 회원이 유료서비스 구매 시 쉽게 알 수 있는 방법으로 고지합니다. \n② 청약철회가 가능한 유료서비스의 경우 회원은 구매일로부터 7일 이내에 청약철회를 할 수 있습니다. \n";
Resource.KoreanTxt["second_tip_full_6"] ="③ 다음 각 호의 경우에는 청약철회가 제한됩니다.\n1. 단품형 아이템의 경우\n2. 구매 후 즉시 사용이 시작되거나 게임에 즉시 적용되는 아이템의 경우\n3. 게임서비스의 이용과정에서 획득한 아이템의 경우\n4. 부가혜택이 제공되는 아이템에서 해당 부가혜택이 사용된 경우\n5. 묶음형으로 판매된 아이템의 일부가 사용된 경우\n6. 개봉행위를 사용으로 볼 수 있거나 개봉 시 효용이 결정되는 캡슐형/확률형 아이템의 경우\n④ 만약 유료서비스의 내용이 표시•광고 내용과 다르거나 계약내용과 다르게 이행된 경우에는 구매일 또는 유료서비스 이용가능일로부터 3월 이내, 그 사실을 안 날 또는 알 수 있었던 날부터 30일 이내에 청약철회를 할 수 있습니다.\n⑤ 미성년자가 법정대리인의 동의 없이 유료서비스를 구매한 경우, 미성년자 또는 법정대리인은 결제를 취소할 수 있습니다. \n단, 미성년자가 사술 등을 사용하여 성년자로 믿게 한 경우 등에는 취소가 제한될 수 있으며, \n유료서비스 구매자가 미성년자인지 아닌지 여부는 유료서비스 결제가 진행된 단말기 등 결제수단의 명의자를 기준으로 판단합니다.\n⑥ 회원은 전화 또는 서면(전자문서 포함), 전자우편 등의 방법으로 청약철회를 할 수 있습니다.\n\n제 19 조 (청약철회의 효과)\n\n① 회원이 청약철회를 한 경우 회사는 지체 없이 회원의 유료서비스를 회수 또는 삭제하고, \n환급에 필요한 서류 등을 접수한 날로부터 3영업일 이내에 오픈마켓사업자에 대한 결제취소요청 등 환급에 필요한 절차를 개시합니다.\n② 회사는 결제대금을 환급함에 있어 회원이 신용카드나 그 밖에 전자상거래 등에서의 소비자보호에 관한 법률 시행령으로 정하는 결제수단으로 대금을 지급한 때에는 지체 없이 당해 결제수단을 제공한 사업자로 하여금 결제대금의 청구를 정지 또는 취소하도록 요청합니다. \n다만 회사가 결제업자로부터 이미 대금을 지급받은 때에는 이를 결제업자에게 환급하고 이를 소비자에게 통지합니다.\n③ 회사는 아이템 등이 일부 사용되거나 소비된 경우에는 회원이 얻은 이익 또는 해당 아이템 등의 공급에 든 비용에 상당하는 금액을 회원에게 청구할 수 있습니다.\n④ 회사는 필요한 경우 회원에게 환급에 필요한 서류를 요구할 수 있으며, 회원이 이를 거부할 경우에는 환급이 제한될 수 있습니다.\n\n제 20 조 (환불)\n\n① 청약철회의 원인이 회원의 변심 등 회원의 귀책사유로 인한 경우에는 제19조 제3항의 이익과 함께 결제대행수수료 등 기타 제반 비용을 공제하고 환불합니다. \n② 선물하기 기능을 통하여 이루어진 결제에 대하여는 구매한 아이템에 하자가 있는 경우를 제외하고는 원칙적으로 환급이 불가하며, \n아이템의 하자로 인한 환급은 선물을 보낸 이용자에 한하여 가능합니다.\n③ 현행법령 및 중대한 약관 위반 등 회원의 귀책사유로 이용계약을 해지하는 경우 환불이 제한될 수 있습니다.\n\n제 21 조 (계약의 해제 및 해지)\n\n① 회원은 회원의 사정으로 게임서비스 이용계약을 해지할 수 있습니다. \n";
Resource.KoreanTxt["second_tip_full_7"] = "② 회원이 이용계약을 해지하기를 원하는 경우에는 회사가 정하는 소정의 절차에 따라 회원탈퇴 신청을 하여야 합니다.\n③ 회원이 본 약관에서 정한 회원의 의무를 위반한 경우 회사는 회원에 대한 사전 통지 후 계약을 해지하거나 일정기간 동안 게임서비스 이용을 제한할 수 있습니다. 다만, \n회원이 현행법 위반 및 고의 또는 중대한 과실로 회사에 손해를 입힌 경우에는 사전 통보 없이 이용계약을 해지할 수 있습니다. \n④ 회원이 제3항을 위반하여 받을 수 있는 제한조치의 구체적인 내용은 운영정책 등 회사의 정책에 따라 정해지며 회사 홈페이지를 통하여 확인하실 수 있습니다. \n⑤ 제3항 단서에 따라 이용계약이 해지되는 경우, 회원은 유료서비스의 사용권한을 상실하고 이로 인한 환불 및 손해배상을 청구할 수 없습니다.\n⑥ 회사가 이용계약을 해지하는 경우 회사는 회원에게 전자우편이나 문자메시지 발송 등의 방법으로 회원에게 통보합니다.\n\n제 22 조 (이의신청) \n\n회사는 회원이 제기하는 불만이나 이의가 정당하다고 판단할 때에는 합리적인 기간 내에 이를 신속하게 처리합니다.\n 다만, 처리에 장기간이 소요되는 경우에는 회원에게 장기간이 소요되는 사유와 처리일정을 회사 홈페이지에 공지하거나 전자우편, 전화 또는 서면 등으로 통보합니다.\n\n제 23 조 (손해배상) \n\n① 회사는 회사가 제공하는 게임서비스와 관련하여 회원에게 발생한 손해에 대해서 어떠한 책임도 지지 않습니다. \n다만, 회사의 고의 또는 중대한 과실로 인하여 발생한 손해의 경우는 제외합니다.\n② 회원이 본 약관을 위반하여 회사에 손해를 끼친 경우, 회원은 회사에 대하여 그 손해에 대하여 배상할 책임이 있습니다.\n\n제 24 조 (회사의 면책) \n\n① 회사는 전시, 사변, 천재지변, 비상사태, 현재의 기술로는 해결이 불가능한 기술적 결함 기타 불가항력적 사유로 서비스를 제공할 수 없는 경우에는 책임이 면제됩니다.\n② 회사는 회원의 귀책사유로 인한 게임서비스의 중지, 이용장애 및 계약해지에 대하여 책임이 면제됩니다.\n③ 회사는 기간통신 사업자가 전기통신서비스를 중지하거나 정상적으로 제공하지 아니하여 회원에게 손해가 발생한 경우에 대해서 회사의 고의 또는 중대한 과실이 없는 한 책임이 면제됩니다.\n④ 회사는 사전에 공지된 게임서비스용 설비의 보수, 교체, 정기점검, \n공사 등 부득이한 사유로 게임서비스가 중지되거나 장애가 발생한 경우에 대해서 회사의 고의 또는 중대한 과실이 없는 한 책임이 면제됩니다.\n⑤ 회사는 회원의 모바일 네트워크 또는 모바일 디바이스 환경으로 인하여 발생하는 제반 문제 또는 회사의 고의 또는 중대한 과실이 없는 \n네트워크 환경으로 인하여 발생하는 문제에 대해서 책임이 면제됩니다.\n⑥ 회사는 회원 또는 제3자가 게임서비스 내 또는 회사 홈페이지 상에 게시 또는 전송한 정보, 자료, 사실의 신뢰도,\n 정확성 등의 내용에 대해서는 회사의 고의 또는 중대한 과실이 없는 한 책임이 면제됩니다.\n⑦ 회사는 회원 상호간 또는 회원과 제3자간에 게임서비스를 매개로 발생한 분쟁에 대해 개입할 의무가 없으며 이로 인한 손해를 배상할 책임도 없습니다.\n";

Resource.KoreanTxt["second_tip_full_8"] = "⑧ 회사가 제공하는 게임서비스 중 무료서비스의 경우에는 회사의 고의 또는 중대한 과실이 없는 한 회사는 손해배상을 하지 않습니다.\n⑨ 본 게임서비스 중 일부의 게임서비스는 다른 사업자가 제공하는 게임서비스를 통하여 제공될 수 있으며, \n회사는 다른 사업자가 제공하는 게임서비스로 인하여 발생한 손해 등에 대해서는 회사의 고의 또는 중대한 과실이 없는 한 책임이 면제됩니다.\n⑩ 회사는 회원이 게임서비스를 이용하며 기대하는 캐릭터, 경험치, 아이템 등의 결과를 얻지 못하거나 상실한 것에 대하여 책임을 지지 않으며, \n게임서비스에 대한 취사선택 또는 이용으로 발생하는 손해 등에 대해서 회사의 고의 또는 중대한 과실이 없는 한 책임이 면제됩니다.\n⑪ 회사는 회원의 게임상 사이버 자산(게임머니), 등급/내공 손실에 대하여 회사의 고의 또는 중대한 과실이 없는 한 책임이 면제됩니다.\n⑫ 회사는 회원의 모바일 디바이스 오류에 의한 손해가 발생한 경우 또는 신상정보 및 전자우편주소를\n 부정확하게 기재하거나 미기재하여 손해가 발생한 경우에 대하여 회사의 고의 또는 중대한 과실이 없는 한 책임이 면제됩니다.\n⑬ 회사는 관련 법령, 정부 정책 등에 따라 게임서비스 또는 회원에 따라 게임서비스 이용시간 등을 제한할 수 있으며, \n이러한 제한사항 및 제한에 따라 발생하는 게임서비스 이용 관련 제반사항에 대해서는 책임이 면제됩니다.\n\n제 25 조 (재판권 및 준거법) \n\n본 약관은 대한민국 법률에 따라 규율되고 해석되며, 회사와 회원간에 발생한 분쟁으로 소송이 제기되는 경우, 회사의 주된 사무소 소재지를 관할하는 법원을 관할 법원으로 합니다.\n\n부칙 \n\n본 약관은 2013년 10월 01일부터 시행합니다.\n\n1차 개정 시행일 : 2014년 2월 13일. \n( 개정 내용 : 제 25조 화사의 주된 사무소의 소재지를 관할 법원으로 함 )\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n";

Resource.KoreanTxt["guest_login_tip"] = "Guest로 로그인 하실 경우\n게임 삭제, 디바이스 변경, \n탈퇴 시 게임 정보가 \n삭제될 수 있습니다."//"GUEST로 로그인 하실 경우\n게임 삭제, 디바이스 변경 \n등의 이유로 게임 정보가 \n삭제 될 수 있습니다."

Resource.KoreanTxt["labelFinalTip_2"] = "친구에게 카카오톡 메시지가 발송됩니다.";

Resource.KoreanTxt["share_desc_2"] = "首次分享送" + 10 + "钻石";
//
Resource.KoreanTxt[6] = "식물별에 있는 몬스터를 \n전부 찾았습니다! 다음 \n별로 이동하세요!";
Resource.KoreanTxt[7] =  "남은 연료로는 간신히 \n다음 별로만 이동할 수 있어요!";
Resource.KoreanTxt[8] = "연료? 다 쓰면 몬스터들에게 빨리 \n달라고 하면 됩니다!（다행히 좀전에\n 꽤 많이 훔쳤어요…）";

Resource.KoreanTxt[9] =  "어, 무슨 일이에요?";
Resource.KoreanTxt[10] = "방금 독버섯을 먹었어요. 바보\n같이！";
Resource.KoreanTxt[11] =  "오오, 정말 아름다운 추억이에요！\n다음 별에서는 무엇을 먹게 될까요？";
Resource.KoreanTxt[12] =  "정말 식충이군요. 우리의 \n목표는 몬스터 찾기라는 사실을 잊지 마세요!";

Resource.KoreanTxt[13] = "몬스터를 정말 많이 찾았군요. 하하!";
Resource.KoreanTxt[14] = "해양별도 드디어 \n평화를 찾았군요.";
Resource.KoreanTxt[15] = "이제 꽃별로 갑시다\n！";
Resource.KoreanTxt[16] =  "지금 바로 출발해요！";

Resource.KoreanTxt[17] = "꽃별에 있는 몬스터도 찾았어요. \n하지만 지금 바로 돌아가고 싶지 않네요\n……";
Resource.KoreanTxt[18] = "아직 가봐야 할 별이 \n매우 많아요! 함께 갈래요?";
Resource.KoreanTxt[19] = "좋아요. 더 많은 모험이 우리를 \n기다리고 있답니다!";

Resource.KoreanTxt[20] = "오호, 맛있는 버섯!";
Resource.KoreanTxt[21] = "이봐요, 무턱대고 먹지 말아요!";
Resource.KoreanTxt[22] = "정말 맛있어요! 어...？바나나씨, \n거대 버섯들이 진격해요！";
Resource.KoreanTxt[23] = "이런 식충이！안돼요……";

Resource.KoreanTxt[24] = "요즘 해양별에 한밤중에도 \n이상한 소리를 내는 \n알록달록한 쓰레기가 많다고 해요.";
Resource.KoreanTxt[25] =  "쓰레기라… 마치 오래전에 헤어진 \n형제 같은 기분이 드는 군요…";
Resource.KoreanTxt[26] = "그럼 어서 한번 가보세요. \n정말 그럴지도 모르잖아요！";

Resource.KoreanTxt[27] = "꽃별에는 꽃이 정말 많군요. 꽃가루 때문에 \n자꾸 재채기가 나와요.";
Resource.KoreanTxt[28] = "모든 꽃에서 좋은 열매를 맺게 하려면 \n제가 이곳에 정착해야 해요.";
Resource.KoreanTxt[29] = "쓸데없는 소리 하지 말고, 어서 몬스터나 찾읍시다. 그게 바로 \n우리가 해야 할 일이에요.";

Resource.KoreanTxt[235] = "아하하하하! 황금 천지다! \n우리가 드디어 부자가 되었어요!";
Resource.KoreanTxt[236] = "'우리'라고 말해줘서 고마워요. 하지만 \n이것들은 높은 온도에서 녹은 뜨거운 금이에요. \n어떻게 가져갈 건가요?";
Resource.KoreanTxt[237] = "그래요？！그럼 가져갈 방법이 없네요……\n너무 피곤해요. 더 이상 아무도 사랑할 수 없을 것 같아요\n……";
Resource.KoreanTxt[238] = "쓸데없는 소리 하지 말고, 조심해요. 이 \n별에는 위험한 폭탄이 많아요!";

Resource.KoreanTxt[239] = "어서 가요. 서두르지 않으면 콜라가 \n감기약으로 변해버릴 거예요!";
Resource.KoreanTxt[240] = "아아아아…… 사랑하는 나의 \n황금아！곧 돌아올게!";
Resource.KoreanTxt[241] = "그런 추잡한 말을 하다니. 지금 내 손에 \n후라이팬이 없는 게 참으로 아쉽군요.";

Resource.KoreanTxt[242] = "이것 좀 봐요. 내 얼음 조각이 정말 \n멋지지 않나요！";
Resource.KoreanTxt[243] = "너무 차가워요…… 부들부들 떨면서 \n왜 옷을 더 입지 않는 건가요!";
Resource.KoreanTxt[244] = "옷을 계속 안 입는 것이야말로 우리 \n몬스터들의 낭만적이고 우아한 품격이랍니다!";
Resource.KoreanTxt[245] = "콧물이나 좀 닦고 \n품격을 자랑하시죠!";

Resource.KoreanTxt[246] = "드디어 이 별을 떠날 수 있게 되었어요.\n 이런, 안테나가 꽁꽁 얼고 있어요\n！";
Resource.KoreanTxt[247] = "찬바람 속에서 계속 \n포즈를 잡으려는 줄 알았어요. 얼음조각으로 \n변할 때까지 말이에요.";
Resource.KoreanTxt[248] = "훗날 나의 서사적인 모험이 후세에 존경을 받게 \n하려면 이제 \n따뜻한 별로 가야만 해요……";

Resource.KoreanTxt[249] = "다코야키！이 별을 \n먹어치우겠어요！";
Resource.KoreanTxt[250] = "어딜 가든 온통 먹을 생각 뿐이군요. \n이 별에는 몬스터들이 많아요. \n어서 그들을 찾아야만 해요.";
Resource.KoreanTxt[251] = "앞에 있는 다코야키를 먹어버리면 \n몬스터들을 찾을 수 있을 거예요！";
Resource.KoreanTxt[252] = "정말 이유도 가지가지이군요……\n";

Resource.KoreanTxt[253] = "서둘러요. 다음 별이 우리를 \n기다리고 있어요！";
Resource.KoreanTxt[254] = "꺼억…… 잠깐만요. 꺼억……";
Resource.KoreanTxt[255] = "당신은 이제 \n평생 먹는 것만 탐내면서 살게된 \n것 같군요.";

Resource.KoreanTxt[256] = "거대한 눈이 나를 \n노려보고 있는 같아요.";
Resource.KoreanTxt[257] = "끈끈이별의 주인인 \n“진격의 거대 몬스터”에요. 우리의 \n사촌이랍니다！";
Resource.KoreanTxt[258] = "“거대 몬스터”라면 대체 큰 건가요 작은 건가요? \n말이 안되는 것 같아요……";

Resource.KoreanTxt[259] = "사촌형님은 \n정말 더러운 분이군요. 여기저기 온통 \n침으로 가득해요！";
Resource.KoreanTxt[260] = "몬스터의 \n침으로 “\n속병”을 고칠 수 있다는 얘기 못 들어봤어요?";
Resource.KoreanTxt[261] = "주구장창 우스운 소리나 하는 \n사람만 혼자 \n재미있어 한다는 얘기는 들어봤어요.";

//----------------------------------------------------------------------------------------------------------------------
// 초보자 가이드
Resource.KoreanTxt[30] =  "이동하여 같은 색상의 몬스터 3마리를 제거하세요.";
Resource.KoreanTxt[31] =  "통과 목표입니다. 이 목표를 달성하면 \n스테이지를 통과할 수 있어요!~";
Resource.KoreanTxt[32] =  "남은 이동횟수입니다. 목표를 달성하기 전까지 \n전부 사용하지 마세요!~";

Resource.KoreanTxt[33] =  "같은 색상의 몬스터 4마리를 제거하면 \n가로세로 제거 몬스터를 획득할 수 있습니다.";
Resource.KoreanTxt[34] =  "가로세로 제거 몬스터를 제거하면 \n해당 가로열이나 세로열이 제거됩니다.";

Resource.KoreanTxt[35] =  "같은 색상의 몬스터 5마리가 나란히 있을 경우, \n동일 색상 제거 몬스터를 획득할 수 있습니다.";
Resource.KoreanTxt[36] =  "동일 색상 제거 몬스터는 랜덤 색상과 \n나란히 있을 수 있고, 같은 색상의 \n몬스터를 전부 제거할 수 있습니다.";

//Resource.KoreanTxt[37] = "아이템을 사용하세요.";
//Resource.KoreanTxt[38] = "아이템을 사용하세요.";
//Resource.KoreanTxt[39] = "아이템을 사용하면 스테이지를 더 쉽게 \n통과할 수 있어요!~";
Resource.KoreanTxt[40] =  "무료 아이템을 3개 보유 중입니다. \n어서 사용해보세요!~";

Resource.KoreanTxt[41] =  "특수 몬스터 2마리를 \n함께 제거하면 초강력 \n효과가 생겨요！~";
//Resource.KoreanTxt[42] = "정해진 이동횟수 내에서 \n일정한 목표 수량의 \n몬스터를 제거하면 스테이지를 통과할 수 있어요!~";
Resource.KoreanTxt[42] =  "해당 스테이지 목표는 일정한 \n수량의 몬스터를 제거하는 것입니다! 녹색부터 \n시작하세요！";
Resource.KoreanTxt[43] =  "좋아요! 이제 노란색 \n몬스터를 제거하세요！";

Resource.KoreanTxt[44] =  "해치의 색상과 동일한 \n몬스터를 제거하세요.";
//Resource.KoreanTxt[45] = "해치 색상은 랜덤으로 변합니다.";
//Resource.KoreanTxt[46] = "제거할 목표수량";
Resource.KoreanTxt[47] =  "일정한 수량에 도달하면 \n스테이지를 통과하게 됩니다！";

Resource.KoreanTxt[48] =  "감금된 몬스터의 감옥이 \n제거되면 감옥이 파괴되고, 몬스터가 \n자유롭게 이동할 수 있습니다.";
Resource.KoreanTxt[49] =  "얼음조각 옆에서 3회 제거해야만 \n완전히 파괴할 수 있습니다.";

//Resource.KoreanTxt[50] = "몬스터에 기생하는 젤리몬스터가 \n구조활동을 방해할 수 있습니다.";
Resource.KoreanTxt[51] =  "젤리몬스터가 분열하지 못하도록 \n어서 제거하세요！";
Resource.KoreanTxt[52] =  "젤리몬스터 안에 있는 몬스터를 제거하려면 \n먼저 젤리몬스터를 제거해야 합니다!";
//Resource.KoreanTxt[53] = "젤리몬스터 제거 수량";
Resource.KoreanTxt[54] =  "목표 수량의 젤리몬스터를 제거해야만 \n스테이지를 통과할 수 있어요!~";

Resource.KoreanTxt[55] =  "정해진 시간 동안 스테이지 \n목표를 달성하세요！~";
Resource.KoreanTxt[56] =  "이동할 때마다 폭탄 개수가 \n하나씩 줄어듭니다. 폭탄이 터지기 전에 같은 색상의 \n몬스터로 폭탄을 제거하세요!";
//Resource.KoreanTxt[57] = "폭탄은 같은 색상의 몬스터와 \n함께 제거 가능합니다.";
//Resource.KoreanTxt[58] = "한번 이동할 때마다 \n폭탄 카운트다운의 숫자가 하나씩 줄어듭니다. 카운트다운이 종료되면 \n폭탄이 터져 \n주변의 몬스터를 얼음으로 만들어버립니다.";

Resource.KoreanTxt[59] =  "몬스터를 제거하여 \n아래층을 부서버리세요！";

Resource.KoreanTxt[60] =  "위에 있는 몬스터를 2회 \n제거해야만 두터운 아래층을 \n부술 수 있습니다！~";

Resource.KoreanTxt[61] =  "동일한 합체 몬스터 3마리가 \n1레벨 높은 합체 몬스터 1마리로 변합니다.";
//Resource.KoreanTxt[62] = "합체 몬스터는 세 개의 레벨로 나뉩니다. 정상적인 \n상태에서는 1레벨이며, 동일한 레벨의 \n합체 몬스터 3마리는 \n1레벨 높은 합체 몬스터 1마리로 합성 가능합니다.";
//Resource.KoreanTxt[63] = "합체 목표";
Resource.KoreanTxt[64] =  "합체 목표는 3레벨 합체 몬스터입니다. \n2회 레벨업 해야만 획득 가능합니다.";

//Resource.KoreanTxt[65] = "돌-돌 주변에서 제거하면 \n돌을 쉽게 깨뜨려 \n장애물을 제거할 수 있습니다.";

Resource.KoreanTxt[66] = "페퍼민트 캔디가 없습니다. 친구에게 도움을 청하세요！";

Resource.KoreanTxt["LEVEL_12_1"] =  "슈퍼 별똥별은 정말 \n대단해요！~";
Resource.KoreanTxt["LEVEL_12_2"] =  "별똥별로 몬스터 \n1마리를 구출하고, 몬스터가 있는 곳의 \n모든 장애물을 제거하세요！";
Resource.KoreanTxt["FireDropTip"] =  "슈퍼 별똥별로 현재 위치한 곳의 몬스터를 구출하세요！";
Resource.KoreanTxt["LEVEL_12_3"] =  "연속 사용 시 효과를 강화할 수 있습니다. \n별똥별을 사용할 때마다 몬스터 5마리를 구출할 수 있습니다！";
Resource.KoreanTxt["LEVEL_12_4"] =  "어서 한번 해보세요！~";
Resource.KoreanTxt["LEVEL_12_5"] =  "효과가 계속 강화됩니다. 사용할 때마다 \n3×3칸에 있는 몬스터를 구출할 수 있습니다！";
Resource.KoreanTxt["LEVEL_12_6"] =  "더 멋진 효과를 한번 사용해보세요\n！~";

//----------------------------------------------------------------------------------------------------------------------
// 초보자 추가 가이드
Resource.KoreanTxt[67] =  "아이템을 사용하면 스테이지를 더 쉽게 \n통과할 수 있어요！~";
Resource.KoreanTxt[68] =  "타임룰렛을 사용하면 보상시간을 \n랜덤으로 뽑을 수 있습니다.";
Resource.KoreanTxt[69] =  "돌 주변에서 제거하면 돌을 \n쉽게 깨뜨릴 수 있습니다.";
Resource.KoreanTxt[70] =  "지정된 몬스터 2마리의 \n위치를 바꿀 수 있습니다.";

Resource.KoreanTxt[71] =  "" + Defines.DIAMOND_REWARD.GUIDE_REWARD + "다이아를 드립니다. 이제 \n아이템을 구입할 수 있습니다！";
//Resource.KoreanTxt[72] = "파워 아이템이 스테이지 통과를 도와줄 것입니다！";
Resource.KoreanTxt[73] =  "선택할 아이템이 아직 많아요！";
Resource.KoreanTxt[74] =  "어서 당신의 성적을 친구들과 \n공유하세요. 친구들이 아마 \n충격을 받을 거예요!~";

Resource.KoreanTxt[75] =  "폭탄제거 몬스터가 제거되면 \n주변 \n3×3범위에 있는 몬스터를 2회 폭파 제거시킵니다.";
Resource.KoreanTxt[76] =  "같은 열에 있지 않은 몬스터 \n5마리를 제거하면 폭탄제거 몬스터를 획득할 수 있습니다.";
Resource.KoreanTxt[77] =  "어서 우리 함께 \n상점으로 가요.";
Resource.KoreanTxt[78] =  "어서 가로세로 제거 몬스터를 구입하세요.";
Resource.KoreanTxt[79] =  "자, 계속 게임을 즐겨보아요！";
Resource.KoreanTxt[80] =  "잠금 해제가 가능한 네 번째 아이템이 \n있어요！~";

Resource.KoreanTxt["showTotalLevel"] = "제10스테이지를 완료하면 전체 랭킹을 조회할 수 있어요！";
//----------------------------------------------------------------------------------------------------------------------
//메일 관련:
Resource.KoreanTxt[81] =  "나";
Resource.KoreanTxt[82] =  "페퍼민트 캔디 1개를 드립니다.";
Resource.KoreanTxt[83] =  "당신의 도움이 필요합니다.";
Resource.KoreanTxt[84] =  "당신을 돕습니다.";
Resource.KoreanTxt[85] =  "페퍼민트 캔디 1개를 요청합니다.";
Resource.KoreanTxt[86] = "친구 초대";

Resource.KoreanTxt[87] =/* "진격의 몬스터\n"
    + "V" + GAME_VERSION
    + */"\n본 게임의 저작권은 베이징 추콩 테크놀로지에 있으며, \n게임에 사용된 텍스트와 이미지 등의 모든 콘텐츠도 \n저작권 소유자에게 귀속됩니다. \n추콩코리아";
Resource.KoreanTxt[88] = "고객센터：yourstar_support@kr.chukong-inc.com";

Resource.KoreanTxt["game_name"] = "너네별로돌아가";



//----------------------------------------------------------------------------------------------------------------------
Resource.KoreanTxt[96] = "위치를 바꿀 몬스터를 선택해주세요.";
Resource.KoreanTxt[97] = "교환할 다른 몬스터를 선택해주세요.";
Resource.KoreanTxt[98] = "페퍼민트 캔디를 사용하면 자동 회복됩니다. 지금 바로 구입할 수 있어요.";
Resource.KoreanTxt[100] = "구입했습니다.";

//
Resource.KoreanTxt[101] = "로그아웃하고 계정을 \n전환하시겠습니까?";
Resource.KoreanTxt[102] = "서버에 진행상황이 저장된 파일이 있습니다. \n해당 파일을 기기에 다운로드하시겠습니까?";
Resource.KoreanTxt[103] = "게임을 시작하세요!";

//
Resource.KoreanTxt[108] = "로그인하면 친구와 서로 도울 수 있어요!";
Resource.KoreanTxt[109] = "지금 게임을 시작하세요!";
Resource.KoreanTxt[110] = "서버에 진행상황이 저장된 파일이 있습니다. \n해당 파일을 기기에 다운로드하시겠습니까?";

Resource.KoreanTxt[111] = "지금 로그인하면 페퍼민트 캔디 \n보상을 드립니다！";
Resource.KoreanTxt[112] = "잠시 후에 다시 말씀해주세요.";
Resource.KoreanTxt[113] = "최초 로그인 보상";

Resource.KoreanTxt[114] = "어서 아이템을 사용하세요.";
Resource.KoreanTxt[115] = "여기를 클릭하여 어서 \n모험을 시작하세요！";

Resource.KoreanTxt[116] = "이런!\n\n아직 해당 스테이지를\n\n통과하지 못했어요\n\n친구들보다\n\n더 높은 점수로\n\n스테이지를 통과하시고\n\n1등을 해보세요!";

Resource.KoreanTxt["new_pack"] = "19위안 짜리를 지금 \n1위안에 드립니다！";
Resource.KoreanTxt["new_pack_ios"] = "    $8.99의 아이템을\n 지금 $2.99에 구매하세요";
Resource.KoreanTxt["new_pack_andorid"] = "    9900원의 아이템을\n 지금 3300원에 구매하세요";
//
Resource.KoreanTxt[117] = "아이템 슬롯을 잠금 해제하면 \n4번째 파워 아이템을 사용할 수 있어요！";

//----------------------------------------------------------------------------------------------------------------------
Resource.KoreanTxt[160] = "새로운 별에서 다이아 보상을 더 많이 획득할 수 있습니다！";
Resource.KoreanTxt[161] = "3성에 도전하면 다이아를 더 많이 획득할 수 있어요！";
Resource.KoreanTxt[162] = "가득 찼습니다.";
Resource.KoreanTxt[166] = "곧 오픈됩니다.";
Resource.KoreanTxt[167] = "다이아가 부족합니다. 스테이지에 \n도전하면 다이아를 더 많이 획득할 수 있어요！";
Resource.KoreanTxt[168] = "구입 성공";
Resource.KoreanTxt[169] = "잠금 해제";
Resource.KoreanTxt[170] = "파워 아이템은 \n제5스테이지에서 오픈됩니다. 어서 출발하세요!";
Resource.KoreanTxt[171] = "해당 스테이지의 잠금을 해제한 후에 다시 오세요！";
Resource.KoreanTxt[172] = "앞의 3개의 \n아이템 슬롯을 개방한 후에 다시 오세요！";
//----------------------------------------------------------------------------------------------------------------------
Resource.KoreanTxt[179] = "가로세로 제거 몬스터를 \n사용하세요！";
Resource.KoreanTxt[180] = "폭탄제거 몬스터로 \n제거해보세요！";
Resource.KoreanTxt[181] = "동일 색상 제거 몬스터를 \n사용하세요！";
Resource.KoreanTxt[182] = "어서 순간이동을 \n사용하세요！";
Resource.KoreanTxt[183] = "어서 대형폭풍을 \n사용하세요！";
Resource.KoreanTxt[184] = "시계를 클릭하여 \n시간을 연장하세요！";
Resource.KoreanTxt[185] = "어서 염색약으로 \n머리색을 바꾸세요！";
Resource.KoreanTxt[186] = "별똥별로 \n장애물을 제거하세요！";

//
Resource.KoreanTxt[192] = "친구 초대 성공！";
Resource.KoreanTxt[193] = "친구 초대 실패！";

//----------------------------------------------------------------------------------------------------------------------
Resource.KoreanTxt["spring_candy"] = "이벤트 시간:1월31일 -- 2월6일;\n이벤트 내용: 이벤트 기간 동안 페퍼민트 캔디 \n증정 시간이 24시간에서\n8시간으로 줄어듭니다.;";
Resource.KoreanTxt["spring_bonusTitle"] = "이벤트 설명";
Resource.KoreanTxt["spring_bonus"] = "음력설부터 7일간 매일 5회 추첨이 가능하며, \n다이아 아이템 등 보상을 드립니다.；";
//--------------------------------------------------------------------------------------------------------------

Resource.KoreanTxt[199] = "로그인 성공!";
Resource.KoreanTxt[200] = "최초 로그인 보상을 획득했습니다!";
Resource.KoreanTxt[201] = "로그인해야만 해당 조작 실행이 가능합니다.";


//----------------------------------------------------------------------------------------------------------------------
Resource.KoreanTxt[203] = "인접해있는 가로세로 제거 몬스터 2마리는 \n서로 제거가 가능하며, 십자가 제거 \n효과를 작동시킬 수 있습니다. 어서 도전해보세요!";
Resource.KoreanTxt[204] = "가로세로 제거 몬스터에 폭탄제거 몬스터를 추가하면 \n3x3 구역 제거가 가능합니다. 어서 도전해보세요！";
Resource.KoreanTxt[205] = "가로세로 제거 몬스터에 동일 색상 제거 몬스터를 추가하면 \n가로세로 제거 몬스터의 색상과 동일한 몬스터가 전부 \n가로세로 제거 몬스터로 변하며 \n놀라운 효과가 일어납니다！";
Resource.KoreanTxt[206] = "폭탄제거 몬스터 2마리를 제거하면 \n5x5 구역 제거가 2회 가능합니다！";
Resource.KoreanTxt[207] = "폭탄제거 몬스터에 동일 색상 제거 \n몬스터를 추가하면 화면 안의 색상이 같은 \n모든 몬스터를 2회 제거할 수 있습니다！";
Resource.KoreanTxt[208] = "동일 색상 제거 몬스터 2마리를 제거하면 \n화면 안의 모든 몬스터를 1회 제거할 수 있습니다！";

//----------------------------------------------------------------------------------------------------------------------
Resource.KoreanTxt[223] = "해당 스테이지의 모든 아이템은 \n1회 무료 사용 가능합니다！어서 도전해보세요~";
Resource.KoreanTxt[224] = "이제 무료로 계속 게임을 즐길 수 있어요\n！~";
Resource.KoreanTxt[225] = "유저님, 무료 게임 기회가 아직 \n2회 남아있어요！~";
Resource.KoreanTxt[226] = "유저님, 이번이 무료 게임 마지막 \n기회예요！~";
Resource.KoreanTxt[227] = "격려카드 10장을 드립니다. \n격려카드로 게임을 계속 즐길 수 있어요\n！~";

Resource.KoreanTxt[228] = "위에 있는 돌을 제거해야만 \n스테이지를 통과할 수 있어요！~";
Resource.KoreanTxt[229] = "무시무시한 폭탄입니다. \n같은 색상의 몬스터가 있어야만 \n폭탄 제거가 가능합니다.";
Resource.KoreanTxt[230] = "제거되지 않은 폭탄에 적힌 \n숫자가 점점 줄어들어 \n0이 되면 폭탄이 터집니다.";
Resource.KoreanTxt[231] = "폭탄이 터지면 \n연기가 퍼집니다.";
Resource.KoreanTxt[232] = "연기 주변에 있는 몬스터를 처치하면 \n연기를 제거할 수 있습니다.";
Resource.KoreanTxt[233] = "연기에 가려진 몬스터는 \n이동할 수 없어요！~";
Resource.KoreanTxt[234] = "연기는 3회 제거해야만 \n완전히 사라져요.";

//----------------------------------------------------------------------------------------------------------------------
Resource.KoreanTxt["map_0"] = "식물별";
Resource.KoreanTxt["map_1"] = "버섯별";
Resource.KoreanTxt["map_2"] = "해양별";
Resource.KoreanTxt["map_3"] = "꽃별";
Resource.KoreanTxt["map_4"] = "황금별";
Resource.KoreanTxt["map_5"] = "얼음별";
Resource.KoreanTxt["map_6"] = "다코야키별";
Resource.KoreanTxt["map_7"] = "끈끈이별";
Resource.KoreanTxt["map_8"] = "동맹별";
Resource.KoreanTxt["map_9"] = "짹짹별";
Resource.KoreanTxt["map_10"] = "큐빅별";

//----------------------------------------------------------------------------------------------------------------------
//TopUp only
//only use in kakao
Resource.KoreanTxt["scroe_topup"] = "친구를 추월 하였습니다. 자랑하시고 민트를 받으세요!";
Resource.KoreanTxt["topup_share_large"] = "추월한 친구에게 자랑하시겠습니까?\n자랑하실 경우 카카오톡으로 메시지가 전송됩니다.";
Resource.KoreanTxt["topup_share_small"] = "(민트는 자랑한 친구당 1일 1회만 받을 수 있습니다.)";

//----------------------------------------------------------------------------------------------------------------------
//KakaoInviteFriends
//only use in kakao
Resource.KoreanTxt["current_invite_I_guess"] = "현재 초대 인원 {0}명";
Resource.KoreanTxt["invite_award"] = "명초대";
Resource.KoreanTxt["invite_for_heart_0"] = "친구 초대를 보내시면";
Resource.KoreanTxt["invite_for_heart_1"] = "1개를 드려요";
Resource.KoreanTxt["invite_friends"] = "님을 초대하고 선물 받기";
Resource.KoreanTxt["invite_message_alert"] = "친구에게 카카오톡 메시지가 발송 됩니다.";
Resource.KoreanTxt["invite_max"] = "하루에 30회만 초대가능합니다";
Resource.KoreanTxt["supported_device"] = "지원하지 않는 OS를 사용하는 친구입니다.";
Resource.KoreanTxt["message_blocked"] = "게임 메시지 수신을 거부한 친구입니다.";
Resource.KoreanTxt["message_block_other"] = "초대 메시지 수신을 거부한 친구입니다.";
Resource.KoreanTxt["invite_in_cd"] = "이미 초대한 유저입니다.";
Resource.KoreanTxt["invite_32"] = "1일 초대 인원을 초과하였습니다. 내일 다시 시도하세요";
Resource.KoreanTxt["ask_heart"] = "님에게 민트 조르기";
Resource.KoreanTxt["ask_help"] = "님에게 민트 조르기";

//----------------------------------------------------------------------------------------------------------------------
//ItemPush
//only use in kakao
Resource.KoreanTxt["discount_mall"] = "약40% 할인된 가격에 드립니다";
Resource.KoreanTxt["push_description"] = "해당 패키지 상품은 청약철회 불가상품입니다.";

//----------------------------------------------------------------------------------------------------------------------
//appraise
Resource.KoreanTxt["appraise"] = "재미있게 즐기셨나요?\n리뷰를 남겨 주시면 더욱 더\n 재미있는 게임이 될 수 있도록\n노력 하겠습니다.";

//----------------------------------------------------------------------------------------------------------------------
//task
Resource.KoreanTxt["task_progress"] = "목표 :";

Resource.KoreanTxt["task_stage_clear"] = "Stage Clear {0}회";
Resource.KoreanTxt["task_complete_share"] = "자랑하기 {0}회";
Resource.KoreanTxt["task_ask_heart"] = "민트 조르기 {0}회";
Resource.KoreanTxt["task_score"] = "Clear 점수 {0}점 획득";
Resource.KoreanTxt["task_buy_diamond"] = "다이아 충전 {0}회";
Resource.KoreanTxt["task_buy_heart"] = "민트 충전 {0}회";
Resource.KoreanTxt["task_prided"] = "보상 완료";
Resource.KoreanTxt[10001] = Resource.KoreanTxt["task_stage_clear"];
Resource.KoreanTxt[10002] = Resource.KoreanTxt["task_complete_share"];
Resource.KoreanTxt[10003] = Resource.KoreanTxt["task_ask_heart"];
Resource.KoreanTxt[10004] = Resource.KoreanTxt["task_score"];
Resource.KoreanTxt[10005] = Resource.KoreanTxt["task_buy_diamond"];
Resource.KoreanTxt[10006] = Resource.KoreanTxt["task_buy_heart"];

//----------------------------------------------------------------------------------------------------------------------
//achievement
Resource.KoreanTxt["achieve_phase"] = "[{0}단계]";

Resource.KoreanTxt["cj001"] = "첫 번째 행성 돌파";
Resource.KoreanTxt["cj002"] = "두 번째 행성 돌파";
Resource.KoreanTxt["cj003"] = "세 번째 행성 돌파";
Resource.KoreanTxt["cj004"] = "네 번째 행성 돌파";
Resource.KoreanTxt["cj005"] = "다섯 번째 행성 돌파";
Resource.KoreanTxt["cj006"] = "여섯 번째 행성 돌파";
Resource.KoreanTxt["cj007"] = "일곱 번째 행성 돌파";
Resource.KoreanTxt["cj008"] = "여덟 번째 행성 돌파";
Resource.KoreanTxt["cj009"] = "아홉 번째 행성 돌파";
Resource.KoreanTxt["cj010"] = "열 번째 행성 돌파";
Resource.KoreanTxt["cj011"] = "열 한번째 행성 돌파";

Resource.KoreanTxt["cj000"] = "행성 돌파!!"
Resource.KoreanTxt["cj101"] = "내가 최고야!!";
Resource.KoreanTxt["cj201"] = "우정의 상징!!";
Resource.KoreanTxt["cj301"] = "징징징~ 떼를 쓰자!!";
Resource.KoreanTxt["cj401"] = "행성 파괴자!!";
Resource.KoreanTxt["cj501"] = "Stage 마스터!!";

Resource.KoreanTxt["cj001_des"] = "{0} Stage 클리어 시 달성";
Resource.KoreanTxt["cj101_des"] = "자랑하기 {0}회 달성";
Resource.KoreanTxt["cj201_des"] = "민트 조르기에 응답하기 {0}회 달성";
Resource.KoreanTxt["cj301_des"] = "친구에게 민트 조르기 {0}달성";
Resource.KoreanTxt["cj401_des"] = "{0} 개의 행성 타이틀에 자신의 닉네임 달기";
Resource.KoreanTxt["cj501_des"] = "별 3개 획득 한 Stage의 개수가 {0}개";

Resource.KoreanTxt["bad_internet"] = "네트워크 연결에 실패하셨습니다. \n게임을 종료 합니다";
//----------------------------------------------------------------------------------------------------------------------
//Common
Resource.KoreanTxt["common_diamond"] = "다이아";

//----------------------------------------------------------------------------------------------------------------------
//
Resource.KoreanTxt["send_heart_title"] = "페퍼민트 캔디를 지금 보내시겠습니까？";
Resource.KoreanTxt["ask_heart_desc"] = "페퍼민트 캔디가 대거 몰려오고 있습니다！";
Resource.KoreanTxt["ask_heart_help"] = "도움 요청";

//----------------------------------------------------------------------------------------------------------------------
//Game
Resource.KoreanTxt["game_continue_0"] = "남음";
Resource.KoreanTxt["game_continue_1"] = "회";
Resource.KoreanTxt["game_continue_2"] = "위안";
Resource.KoreanTxt["game_continue_3"] = "다이아";

//----------------------------------------------------------------------------------------------------------------------
//Map
Resource.KoreanTxt["space_0"] = "스테이지 도전에 성공하여 새로운 별로 이동할 수 있습니다! \n지불하면 지금 바로 출발할 수 있습니다！";
Resource.KoreanTxt["space_1"] = "재도전！";
Resource.KoreanTxt["space_2"] = "지금 출발";
Resource.KoreanTxt["space_3"] = "카운트다운 중";
Resource.KoreanTxt["space_4"] = "다음 스테이지 도전을 시작하세요!";
Resource.KoreanTxt["space_5"] = "새로운 스테이지에 도전하려면 친구에게 \n콜라 요청을 하거나 1200다이아를\n 소비하여 지금 출발이 가능합니다.";//""다음 스테이지 도전을 \n시작하세요! 친구에게 도움을 청해 \n새로운 별로 이동할 수 있어요！";
Resource.KoreanTxt["space_6"] = "친구 3명에게 도움을 얻어 새로운 별로 이동하세요！";
Resource.KoreanTxt["space_7"] = "현재 스테이지를 완료했습니다! 업데이트가 곧 시작되면 \n도전할 관문이 더 많아집니다! 이전의 스테이지를 다시 한번 살펴보고 \n3성을 더 많이 발견해 모든 다이아를 획득하세요!";
Resource.KoreanTxt["space_8"] = "축하합니다. 친구 3명에게 도움을 얻었습니다！";
Resource.KoreanTxt["space_9"] = "콜라를 요청 후 app을 삭제 시 요청한 콜라가 사라질 수 있습니다.";

//----------------------------------------------------------------------------------------------------------------------
//Teach
Resource.KoreanTxt["teach_0"] = "동일 색상 제거 몬스터 3마리는 \n연속 제거가 가능합니다!";
Resource.KoreanTxt["teach_1"] = "동일 색상 제거 몬스터를 연속으로 더 많이 제거하면 특수 몬스터 생성이 가능합니다!";
Resource.KoreanTxt["teach_2"] = "인접해있는 특수 몬스터 2마리는 \n서로 제거가 가능합니다!";
Resource.KoreanTxt["teach_3"] = "게임 목표를 완료해야만 스테이지를 \n통과할 수 있습니다!";
Resource.KoreanTxt["teach_4"] = "모든 장애물은 조작에 영향을 미칠 수 있습니다. \n우선 장애물을 제거하세요!";
Resource.KoreanTxt["teach_5"] = "아이템을 사용하면 스테이지 통과가 \n수월해집니다. 어서 도전을 시작하세요!";

//----------------------------------------------------------------------------------------------------------------------
//Debug
Resource.KoreanTxt["debug_0"] = "加5000钻石";
Resource.KoreanTxt["debug_1"] = "清空钻石";
Resource.KoreanTxt["debug_2"] = "关闭所有关卡";
Resource.KoreanTxt["debug_3"] = "解锁全部关卡";
Resource.KoreanTxt["debug_4"] = "解锁下一关卡";
Resource.KoreanTxt["debug_5"] = "恢复实际关卡";
Resource.KoreanTxt["debug_6"] = "输入兑换码";
Resource.KoreanTxt["debug_7"] = "薄荷糖上限加1";
Resource.KoreanTxt["debug_8"] = "清除薄荷糖";
Resource.KoreanTxt["debug_9"] = "邀请好友";
Resource.KoreanTxt["debug_10"] = "加5颗薄荷糖";
Resource.KoreanTxt["debug_11"] = "加50颗薄荷糖";
Resource.KoreanTxt["debug_12"] = "增加每日奖励";
Resource.KoreanTxt["debug_13"] = "清空每日奖励";
Resource.KoreanTxt["debug_14"] = "200关的地图";
Resource.KoreanTxt["debug_15"] = "250关的地图";
Resource.KoreanTxt["debug_16"] = "下一个太空站";
Resource.KoreanTxt["debug_17"] = "显示帧频";
Resource.KoreanTxt["debug_18"] = "隐藏帧频";
Resource.KoreanTxt["debug_19"] = "各道具加5个";
Resource.KoreanTxt["debug_20"] = "各道具加50个";
Resource.KoreanTxt["debug_21"] = "清空道具";
Resource.KoreanTxt["debug_22"] = "道具列表";
Resource.KoreanTxt["debug_23"] = "分享";

//----------------------------------------------------------------------------------------------------------------------
//Feedback
Resource.KoreanTxt["feedback_subject"] = "진격의 몬스터 유저 피드백 번호";
Resource.KoreanTxt["feedback_content_0"] = "나의 웨이보@";
Resource.KoreanTxt["feedback_content_1"] = "#진격의 몬스터#에서 발견: \n\n\n";

//----------------------------------------------------------------------------------------------------------------------
//Rate
Resource.KoreanTxt["rate_title"] = "몬스터에 대한 좋은 평가 부탁드려요!";
Resource.KoreanTxt["rate_desc"] = "유저님, 어서 점수를 매겨주세요! 유저님의 소중한 의견을 반영하여 신나고 재미있는 스테이지를 더 많이 제공하겠습니다！";
Resource.KoreanTxt["rate_name_0"] = "좋아요！";
Resource.KoreanTxt["rate_name_1"] = "나중에 평가할래요.";
Resource.KoreanTxt["rate_name_2"] = "거절할래요......";
Resource.KoreanTxt["rate_prompt"] = "500 다이아를 드립니다. 평가해주셔서 감사합니다！";

//----------------------------------------------------------------------------------------------------------------------
//Push
Resource.KoreanTxt["push_0"] = "페퍼민트 캔디가 가득 찼습니다. 어서 도전하세요！";
Resource.KoreanTxt["push_1"] = "어서 돌아오세요. 몬스터들이 당신의 구조를 기다리고 있어요！";

//----------------------------------------------------------------------------------------------------------------------
//Pay
Resource.KoreanTxt["pay_0"] = "구입";
Resource.KoreanTxt["pay_1"] = "획득";
Resource.KoreanTxt["pay_2"] = "성공!";
Resource.KoreanTxt["pay_3"] = "충전카드 잔액으로 을(를) 교환했습니다.";
Resource.KoreanTxt["pay_4"] = "개의 다이아!";

//----------------------------------------------------------------------------------------------------------------------
//Msg
Resource.KoreanTxt["msg_0"] = "현재 네트워크를 사용할 수 없습니다！";
Resource.KoreanTxt["msg_1"] = "해당 아이템 슬롯이 다음 스테이지에서 잠금 해제됩니다！";

Resource.KoreanTxt["msg_2"] = "탈퇴하실 경우 모든 \n정보가 삭제되며, \n복구가 불가능 합니다.\n 그래도 탈퇴 하시겠습니까?";
Resource.KoreanTxt["msg_22"] = "모든 게임 데이터가 삭제됩니다";

Resource.KoreanTxt["msg_3"] = "이미 수령！";
Resource.KoreanTxt["msg_4"] = "서두르지 마세요. 튜토리얼을 완료한 후에 다시 로그아웃하세요~";

Resource.KoreanTxt["msg_login_0"] = "로그인 실패！";
Resource.KoreanTxt["msg_login_1"] = "로그인해야만 친구에게 도움을 요청할 수 있습니다!";

Resource.KoreanTxt["msg_login_share_0"] = "지금 웨이보로 친구와 공유하고, \n공유 보상을 획득하세요！";
Resource.KoreanTxt["msg_login_share_1"] = "지금 친구와 공유하고 \n공유 보상을 획득하세요！";

Resource.KoreanTxt["msg_key_0"] = "교환에 성공하여 보상을 드립니다.";
Resource.KoreanTxt["msg_key_1"] = "개의 다이아！";
Resource.KoreanTxt["msg_key_2"] = "자신이 생성한 코드는 사용할 수 없어요~ 서로 도와야만 가능하답니다.";
Resource.KoreanTxt["msg_key_3"] = "해당 교환 코드는 기간이 만료되었거나 이미 사용했습니다!";

//----------------------------------------------------------------------------------------------------------------------
//Mail
Resource.KoreanTxt["mail_content_0"] = "당신의 친구";
Resource.KoreanTxt["mail_content_1"] = "ta에게 도움 요청하기";
Resource.KoreanTxt["mail_content_2"] = "도움 요청";
//收到薄荷糖显示
Resource.KoreanTxt["mail_content_3"] = "님이 민트를 선물했어요.";
//邀请薄荷糖后，收到赠与的薄荷糖时显示
Resource.KoreanTxt["mail_content_4"] = "님을 초대하고 민트를 받았어요.";
//炫耀分享后，赠与薄荷糖是显示
Resource.KoreanTxt["mail_content_5"] = "님을 추월하여 자랑하고 선물을 받았어요.";
//回应薄荷糖的请求
Resource.KoreanTxt["mail_content_6"] = "님이 민트를 요청 했어요.";
//日常或周任务完成后发送的奖励显示
Resource.KoreanTxt["mail_content_7"] = "미션을 완료하여 선물을 받았어요.";
//成就任务完成后发送的奖励显示
Resource.KoreanTxt["mail_content_8"] = "업적을 완료하여 선물을 받았어요.";
//接受好友的求助并支援的内容显示
Resource.KoreanTxt["mail_content_9"] = "님이 미션 진행에 도움이 필요합니다.";
//邀请好友奖励e
Resource.KoreanTxt["mail_content_10"] = "친구를 초대하고 보상을 받았어요.";
//签到奖励
Resource.KoreanTxt["mail_content_11"] = "출석 체크 선물을 받았어요";

//
Resource.KoreanTxt["mail_content_12"] = "친구로 부터 상점 패키지 선물을 받았어요";

//邀请好友
Resource.KoreanTxt["mail_content_13"] = "친구를 초대하고 보상을 받았어요";

//
Resource.KoreanTxt["forum"] = "너네별로돌아가 공식 커뮤니티 주소\nhttp://cafe.naver.com/goyourstar.café";


//----------------------------------------------------------------------------------------------------------------------
//Loading
Resource.KoreanTxt["load_content_0"] =
    "폭력적인 게임을 차단하고, 게임 불법복제를 근절합니다. 적당한 게임은 두뇌활동에 도움을 주지만 지나친 게임은 건강을 해칩니다. \n자체적인 보호능력을 강화하여 게임 사기에 주의하십시오. 아울러 게임 시간을 적절하게 분배하여 건강한 생활을 유지하시기 바랍니다.";

//----------------------------------------------------------------------------------------------------------------------
//Share
Resource.KoreanTxt["share_subject_0"] = "재미있는 게임";

Resource.KoreanTxt["share_content_0"] = "#진격의 몬스터# 귀엽고 깜찍한 몬스터들과 함께 신나는 게임을 즐겨보세요！";
Resource.KoreanTxt["share_content_1"] = "《진격의 몬스터》를 하는 중이에요. 우리 함께 즐겨보아요！";

Resource.KoreanTxt["share_desc_0"] = "최초 공유 시 " + Defines.DIAMOND_REWARD.FIRST_SHARE + "다이아를 드립니다.";
Resource.KoreanTxt["share_desc_1"] = "공유하면 페퍼민트 캔디를 획득할 수 있어요！";

Resource.KoreanTxt["share_preview_0"] = "대단하군요！새로운 스테이지를 완료했습니다！\n친구들과 기쁜 소식을 공유하세요！";
Resource.KoreanTxt["share_preview_1"] = "새로운 별의 잠금을 해제해습니다! \n이렇게 대단한 성적은 친구들과 함께 공유해야죠！";
Resource.KoreanTxt["share_preview_2"] = "대단해요！모든 스테이지를 완료했습니다. \n당신이 바로 몬스터의 신이에요! 어서 공유하세요！";
Resource.KoreanTxt["share_preview_3"] = "친구를 넘어섰습니다. 이렇게 대단한 일을 \nTa에게 알릴 수 있어요. 어서 자랑하세요！";
Resource.KoreanTxt["share_preview_4"] = "하하, 친구보다 더 높은 순위로 올라갔군요！\n어서 친구들에게 자랑하세요！";
Resource.KoreanTxt["share_preview_5"] = "어서 친구들을 초대해 게임을 즐기세요! \n페퍼민트 캔디를 획득할 수 있답니다！";

Resource.KoreanTxt["share_succ_0"] = "최초 공유에 성공하여 다이아 100개를 보상으로 드립니다！";
Resource.KoreanTxt["share_succ_1"] = "공유에 성공하여 페퍼민트 캔디 1개를 보상으로 드립니다！";

Resource.KoreanTxt["share_name_0"] = "웨이보";
Resource.KoreanTxt["share_name_1"] = "위챗 친구";
Resource.KoreanTxt["share_name_2"] = "친구 그룹";
Resource.KoreanTxt["share_name_3"] = "QQ";
Resource.KoreanTxt["share_name_4"] = "런런왕";
Resource.KoreanTxt["share_name_5"] = "메일";

//----------------------------------------------------------------------------------------------------------------------
//Update App
Resource.KoreanTxt["update_title_0"] = "공지";
Resource.KoreanTxt["update_title_1"] = "업데이트 중";
Resource.KoreanTxt["update_title_2"] = "알림";

Resource.KoreanTxt["update_desc_0"] = "업데이트된 콘텐츠가 있습니다! \n지금 업데이트하시겠습니까？";
Resource.KoreanTxt["update_desc_1"] = "파일 개수";
Resource.KoreanTxt["update_desc_2"] = "업데이트가 완료되었습니다. \n재부팅해야만 \n업데이트가 적용됩니다！";
Resource.KoreanTxt["update_desc_3"] = "업데이트가 완료되었습니다. \n지금 \n재부팅하시겠습니까？";
Resource.KoreanTxt["update_desc_4"] = "다운로드에 실패했습니다. \n네트워크 접속 \n상태를 확인해주세요！";
Resource.KoreanTxt["update_desc_5"] = "업데이트가 완료되었습니다. \n새로운 버턴을 \n설치해주세요！";

Resource.KoreanTxt["update_name_0"] = "지금 업데이트";

//----------------------------------------------------------------------------------------------------------------------
//Shop
Resource.KoreanTxt["shop_cell_storage"] = "기존 개수";

Resource.KoreanTxt["item_max"] = "아이템 소지 개수가 최대치입니다. 소모 후 다시 시도하세요.";

Resource.KoreanTxt["free_candy_max"] = "이미 동일한 효과가 지속 중입니다. 해당 효과 시간이 종료 후 구매 해 주세요.";

//----------------------------------------------------------------------------------------------------------------------
//상품
Resource.KoreanTxt["diamond_name_base_0"] = "400다이아";
Resource.KoreanTxt["diamond_name_base_1"] = "1000다이아 80다이아 추가 증정";
Resource.KoreanTxt["diamond_name_base_2"] = "2000다이아 200다이아 추가 증정";
Resource.KoreanTxt["diamond_name_base_3"] = "3000다이아 400다이아 추가 증정";
Resource.KoreanTxt["diamond_name_base_4"] = "4000다이아 600다이아 추가 증정";
Resource.KoreanTxt["diamond_name_base_5"] = "6000다이아 1000다이아 추가 증정";
Resource.KoreanTxt["diamond_name_base_6"] = "13600다이아 3200다이아 추가 증정";
Resource.KoreanTxt["diamond_name_base_7"] = "25600다이아 8000다이아 추가 증정";
Resource.KoreanTxt["diamond_name_base_8"] = "65600다이아 21000다이아 추가 증정";
Resource.KoreanTxt["diamond_name_base_9"] = "129600다이아 45000다이아 추가 증정";

Resource.KoreanTxt["diamond_desc_base_0"] = "400다이아를 2위안에 드립니다！";
Resource.KoreanTxt["diamond_desc_base_1"] = "1000다이아를 5위안에 드립니다. 80다이아 추가 증정！";
Resource.KoreanTxt["diamond_desc_base_2"] = "2000다이아를 10위안에 드립니다. 200다이아 추가 증정！";
Resource.KoreanTxt["diamond_desc_base_3"] = "3000다이아를 15위안에 드립니다. 400다이아 추가 증정！";
Resource.KoreanTxt["diamond_desc_base_4"] = "4000다이아를 20위안에 드립니다. 600다이아 추가 증정！";
Resource.KoreanTxt["diamond_desc_base_5"] = "6000다이아를 30위안에 드립니다. 1000다이아 추가 증정！";
Resource.KoreanTxt["diamond_desc_base_6"] = "13600다이아를 68위안에 드립니다. 3200다이아 추가 증정！";
Resource.KoreanTxt["diamond_desc_base_7"] = "25600다이아를 128위안에 드립니다. 8000다이아 추가 증정！";
Resource.KoreanTxt["diamond_desc_base_8"] = "65600다이아를 328위안에 드립니다. 21000다이아 추가 증정！";
Resource.KoreanTxt["diamond_desc_base_9"] = "129600다이아를 648위안에 드립니다. 45000다이아 추가 증정！";

Resource.KoreanTxt["heart_name_base_0"] = "페퍼민트 캔디 5개";
Resource.KoreanTxt["heart_name_base_1"] = "페퍼민트 캔디 10개";
Resource.KoreanTxt["heart_name_base_2"] = "페퍼민트 캔디 중형 상자";
Resource.KoreanTxt["heart_name_base_3"] = "페퍼민트 캔디 대형 상자";
Resource.KoreanTxt["heart_name_base_4"] = "페퍼민트 캔디 최대치 \n1개 추가";

Resource.KoreanTxt["heart_desc_base_0"] = "페퍼민트 캔디가 5개 추가됩니다！";
Resource.KoreanTxt["heart_desc_base_1"] = "페퍼민트 캔디가 10개 추가됩니다！2개 추가 증정！";
Resource.KoreanTxt["heart_desc_base_2"] = "페퍼민트 캔디가 20개 추가됩니다！5개 추가 증정！";
Resource.KoreanTxt["heart_desc_base_3"] = "페퍼민트 캔디가 50개 추가됩니다！\n15개 추가 증정！신나게 게임을 즐겨보세요！";
Resource.KoreanTxt["heart_desc_base_4"] = "페퍼민트 캔디 최대치가 1개 추가되고 효과가 영구적으로 지속됩니다！";

Resource.KoreanTxt["item_name_base_0"] = "가로세로 제거";
Resource.KoreanTxt["item_name_base_1"] = "폭탄제거";
Resource.KoreanTxt["item_name_base_2"] = "동일 색상 제거";
Resource.KoreanTxt["item_name_base_3"] = "순간이동";
Resource.KoreanTxt["item_name_base_4"] = "타임룰렛";
Resource.KoreanTxt["item_name_base_5"] = "염색약";
Resource.KoreanTxt["item_name_base_6"] = "대형폭풍";
Resource.KoreanTxt["item_name_base_7"] = "별똥별";

Resource.KoreanTxt["item_desc_base_0"] = "가로세로 제거 몬스터를 \n생성해 가로세로줄을 \n전부 제거하세요！";
Resource.KoreanTxt["item_desc_base_1"] = "폭탄제거 몬스터를 \n생성해 3x3 구역을 2회 \n제거하세요！";
Resource.KoreanTxt["item_desc_base_2"] = "화면 안의 동일 색상 \n몬스터를 전부 \n제거하세요！";
Resource.KoreanTxt["item_desc_base_3"] = "지정한 몬스터 \n2마리의 위치를 \n서로 바꾸세요!";
Resource.KoreanTxt["item_desc_base_4"] = "시간을 연장하세요！\n행운을 빌어요！";
Resource.KoreanTxt["item_desc_base_5"] = "특정 색상의 몬스터가 \n부족한가요？지금 바로 \n염색약을 \n사용하세요！";
Resource.KoreanTxt["item_desc_base_6"] = "몬스터의 위치를 \n다시 정렬하세요！";
Resource.KoreanTxt["item_desc_base_7"] = "지정 몬스터를 구출하고 \n해당 위치에 있는 모든 \n장애물을 제거하세요！";

Resource.KoreanTxt["time_name_base_0"] = "시간 추가";
Resource.KoreanTxt["move_name_base_0"] = "이동횟수 추가";

Resource.KoreanTxt["time_desc_base_0"] = "목표에 곧 달성하나요? 목표 달성 시 15초가 바로 추가됩니다! 아이템도 3개 드려요!";
Resource.KoreanTxt["move_desc_base_0"] = "목표에 곧 달성하나요? 목표 달성 시 5초가 바로 추가됩니다! 아이템도 3개 드려요!";

Resource.KoreanTxt["pack_name_base_0"] = "초보자 특별선물";
Resource.KoreanTxt["pack_name_base_1"] = "슈퍼 대형선물";
Resource.KoreanTxt["pack_name_base_2"] = "메가특급 선물";

Resource.KoreanTxt["pack_desc_base_0"] = "다이아 1200개, 가로세로 제거, 폭탄제거, 동일 색상 제거 몬스터 각각 5마리(기존가격 19위안)를 초보자에게 특별히 5위안에 드립니다! 1회 구입만 가능해요！";
Resource.KoreanTxt["pack_desc_base_1"] = "각종 아이템 5개를 \n(기존가격 14500다이아) \n9700다이아에 드립니다!"//각종 아이템 5개를 \n(기존가격 75위안) \n45위안에 드립니다！";
Resource.KoreanTxt["pack_desc_base_2"] = "각종 아이템 25개를 \n(기존가격 72500다이아) \n39700다이아에 드립니다!"//"각종 아이템 25개를 \n(기존가격 375위안) \n198위안에 드립니다！";

Resource.KoreanTxt["new_zone_name_base"] = "새로운 별 잠금 해제";
Resource.KoreanTxt["activate_name_base"] = "정품 인증";

Resource.KoreanTxt["new_zone_desc_base"] = "새로운 별로 이동하세요！";
Resource.KoreanTxt["activate_desc_base"] = "정품 인증";

Resource.KoreanTxt["continue_name_base_0"] = "게임 계속하기 소형팩";
Resource.KoreanTxt["continue_name_base_1"] = "게임 계속하기 중형팩";
Resource.KoreanTxt["continue_name_base_2"] = "게임 계속하기 대형팩";

Resource.KoreanTxt["continue_desc_base_0"] = "4회 구입 시 1회 증정(다이아 6000 소모)";
Resource.KoreanTxt["continue_desc_base_1"] = "10회 구입 시 3회 증정(다이아 15000 소모)";
Resource.KoreanTxt["continue_desc_base_2"] = "20회 구입 시 8회 증정(다이아 30000 소모)";

//공식사이트
Resource.KoreanTxt["time_name_main_0"] = "게임 계속하기";
Resource.KoreanTxt["move_name_main_0"] = "게임 계속하기";

Resource.KoreanTxt["pack_name_main_0"] = "초보자 대형선물";
Resource.KoreanTxt["pack_desc_main_0"] = "다이아 1200개, 가로세로 제거, 폭탄제거, 동일 색상 제거 몬스터 각각 5마리(기존가격 19위안)를 초보자에게 특별히 1위안에 드립니다! 1회 구입만 가능해요！";

//AppStore
Resource.KoreanTxt["diamond_name_store_1"] = "초급 다이아팩";
Resource.KoreanTxt["diamond_name_store_2"] = "중급 다이아팩";
Resource.KoreanTxt["diamond_name_store_5"] = "고급 다이아팩";
Resource.KoreanTxt["diamond_name_store_6"] = "특급 다이아팩";
Resource.KoreanTxt["diamond_name_store_7"] = "무적 다이아팩";
Resource.KoreanTxt["diamond_name_store_8"] = "마법 다이아팩";
Resource.KoreanTxt["diamond_name_store_9"] = "기적 다이아팩";

Resource.KoreanTxt["diamond_desc_store_1"] = "1200다이아를 6위안에 드립니다. 100다이아 추가 증정！";
Resource.KoreanTxt["diamond_desc_store_2"] = "2400다이아를 12위안에 드립니다. 300다이아 추가 증정！";

Resource.KoreanTxt["pack_desc_store_0"] = "다이아 1200개, 가로세로 제거, 폭탄제거, 동일 색상 제거 몬스터 각각 5마리(기존가격 19위안)를 초보자에게 특별히 6위안에 드립니다! 1회 구입만 가능해요！";

Resource.KoreanTxt["diamond_kakao_android_1"] = "1200 다이아";
Resource.KoreanTxt["diamond_kakao_android_5"] = "6000 다이아";
Resource.KoreanTxt["diamond_kakao_android_6"] = "12000 다이아";
Resource.KoreanTxt["diamond_kakao_android_7"] = "60000 다이아";
Resource.KoreanTxt["diamond_kakao_android_8"] = "120000 다이아";
Resource.KoreanTxt["diamond_kakao_android_9"] = "600000 다이아";

Resource.KoreanTxt["login_push_name"] = "일일 특별 판매";
Resource.KoreanTxt["failed_push_name"] = "특별 패키지";

Resource.KoreanTxt["free_candy_desc"] = "“구성품”\n24시간 자유 이용권\n(실패 시 민트 소모 없음)\n가로세로제거 3개\n동일색상제거 3개\n";

Resource.KoreanTxt["free_candy_name"] = "";

//빠른 사용
Resource.KoreanTxt["diamond_name_kuaiyong_6"] = "10000다이아 2000다이아 추가 증정";
Resource.KoreanTxt["diamond_name_kuaiyong_7"] = "20000다이아 5000다이아 추가 증정";

Resource.KoreanTxt["diamond_desc_kuaiyong_6"] = "10000다이아를 50위안에 드립니다. 2000다이아 추가 증정！";
Resource.KoreanTxt["diamond_desc_kuaiyong_7"] = "20000다이아를 100위안에 드립니다. 5000다이아 추가 증정！";

Resource.KoreanTxt["pack_desc_kuaiyong_1"] = "각종 아이템 5개를 \n(기존가격 75위안) \n50위안에 드립니다！";
Resource.KoreanTxt["pack_desc_kuaiyong_2"] = "각종 아이템 25개를 \n(기존가격 375위안) \n200위안에 드립니다！";

Resource.KoreanTxt["isLogining"] = "로그인 중";
//----------------------------------------------------------------------------------------------------------------------
//
Resource.KoreanTxt["shareWithLevelWin0"] = "#진격의 몬스터# 귀엽고 깜찍한 몬스터들과 함께 즐기는 신나는 게임！ 제 스테이지 도전에 성공했습니다.";
Resource.KoreanTxt["shareWithLevelWin1"] = "#진격의 몬스터# 귀엽고 깜찍한 몬스터들과 함께 즐기는 신나는 게임！제 스테이지를 완료했습니다.";
Resource.KoreanTxt["shareWithLevelWin2"] = "#진격의 몬스터# 귀엽고 깜찍한 몬스터들과 함께 즐기는 신나는 게임！하하, 제 스테이지를 돌파했습니다.";
Resource.KoreanTxt["shareWithLevelWin3"] = "자！어서 한번 겨뤄봅시다！";
Resource.KoreanTxt["shareWithLevelWin4"] = "자！어서 한번 도전해봐요！";

//
Resource.KoreanTxt["getCodeDesc0"] = "보상코드：";
Resource.KoreanTxt["getCodeDesc1"] = "，5다이아로 교환 가능！";

//
Resource.KoreanTxt["shareWithNewMapStar0"] = "#진격의 몬스터# 귀엽고 깜찍한 몬스터들과 함께 즐기는 신나는 게임！모든 스테이지를 완료했습니다！정말 대단해요！";
Resource.KoreanTxt["shareWithNewMapStar1"] = ["식물별", "버섯별", "해양별", "꽃별", "황금별", "얼음별", "다코야키별", "끈끈이별"];
Resource.KoreanTxt["shareWithNewMapStar2"] = "새로운 별";
Resource.KoreanTxt["shareWithNewMapStar3"] = "#진격의 몬스터# 귀엽고 깜찍한 몬스터들과 함께 즐기는 신나는 게임! 제가 왔답니다.";
Resource.KoreanTxt["shareWithNewMapStar4"] = "！새로운 모험이 우리를 기다리고 있어요！";

//
Resource.KoreanTxt["shareWithSurpassFriends0"] = "스테이션 제 에 있습니다.";
Resource.KoreanTxt["shareWithSurpassFriends1"] = "스테이지에서 여러분을 앞섰습니다！";
Resource.KoreanTxt["shareWithSurpassFriends2"] = "제 에 있습니다.";
Resource.KoreanTxt["shareWithSurpassFriends3"] = "#진격의 몬스터# 귀엽고 깜찍한 몬스터들과 함께 즐기는 신나는 게임！다시 전진합니다！";
Resource.KoreanTxt["shareWithSurpassFriends4"] = "여러분을 앞지르니 기분이 정말 좋군요！";
Resource.KoreanTxt["shareWithSurpassFriends5"] = "\n가족들도 알고 있나요？";
Resource.KoreanTxt["shareWithSurpassFriends6"] = "#진격의 몬스터# 귀엽고 깜찍한 몬스터들과 함께 즐기는 신나는 게임！랭킹이 상승했어요！";
Resource.KoreanTxt["shareWithSurpassFriends7"] = "어서 한번 도전해보세요！";

Resource.KoreanTxt["cdkey_right"] = "쿠폰 입력 성공! 상품이 지급되었어요!";
Resource.KoreanTxt["cdkey_error1"] = "쿠폰 번호가 일치하지 않거나 이미 사용된 쿠폰이에요!";
Resource.KoreanTxt["cdkey_error2"] = "이미 사용 했던 쿠폰 종류네요. 다른 쿠폰을 사용해주세요!";