//消除规则的基础类

//======================================================================================================================
//单个对象消除
cc.IDestroyRule = cc.Class.extend({

    //------------------------------------------------------------------------------------------------------------------
    ctor: function(src)
    {
        //
        this.src = src;

        //目标对象
        this.m_Objects = [];
        this.m_IsCreatorRule = false;
    },

    //------------------------------------------------------------------------------------------------------------------
    //简化调用的分析
    parse: function(gameLevel)
    {
        if (this.src)
        {
            //以src为中心 开始分析
            //没有交换对象和交换方向
            this.parseImpl(this.src.getParentNode(),
                null,
                Defines.DIRECTION.NULL,
                gameLevel);
        }

        return this;
    },

    //------------------------------------------------------------------------------------------------------------------
    //分析的核心执行
    //grid 分析的格子
    //swapOther和谁交换
    //swapDir交换方向
    //gameLevel ?
    parseImpl: function(/*grid, swapOther, swapDir, gameLevel*/)
    {
        return this;
    },

    //------------------------------------------------------------------------------------------------------------------
    //是否可以消除?
    can: function()
    {
        return false;
    },

    //------------------------------------------------------------------------------------------------------------------
    //创造消除命令
    createCommand: function()
    {
        return null;
    },

    //------------------------------------------------------------------------------------------------------------------
    //获得这个规则对应的对象
    getSrcObj: function()
    {
        return this.src;
    },

    //------------------------------------------------------------------------------------------------------------------
    //获得消除的对象
    getObjects: function()
    {
        return this.m_Objects;
    },

    //------------------------------------------------------------------------------------------------------------------
    suppose: function()
    {
        return [];
    },

    //------------------------------------------------------------------------------------------------------------------
    isCreatorRule: function()
    {
        return this.m_IsCreatorRule;
    },

    //------------------------------------------------------------------------------------------------------------------
    isSpecHeighRule: function()
    {
        return false;
    }
});

//工厂方法
cc.IDestroyRule.create = function(srcObject)
{
    return new cc.IDestroyRule(srcObject);
};

//======================================================================================================================
cc.IDestroyRule.NORMAL_DES = 0;
cc.IDestroyRule.CREATE_DIR = 1;
cc.IDestroyRule.CREATE_WRAPPER = 2;
cc.IDestroyRule.CREATE_COLORFUL = 3;





